----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 16, 224, 224]           5,200
       BatchNorm2d-2         [-1, 16, 224, 224]              32
              ReLU-3         [-1, 16, 224, 224]               0
              Conv-4         [-1, 16, 224, 224]               0
            Conv2d-5         [-1, 32, 112, 112]           4,640
       BatchNorm2d-6         [-1, 32, 112, 112]              64
              ReLU-7         [-1, 32, 112, 112]               0
              Conv-8         [-1, 32, 112, 112]               0
            Conv2d-9           [-1, 64, 56, 56]          18,496
      BatchNorm2d-10           [-1, 64, 56, 56]             128
             ReLU-11           [-1, 64, 56, 56]               0
             Conv-12           [-1, 64, 56, 56]               0
           Conv2d-13           [-1, 16, 56, 56]           1,024
      BatchNorm2d-14           [-1, 16, 56, 56]              32
             Mish-15           [-1, 16, 56, 56]               0
        Conv_Mish-16           [-1, 16, 56, 56]               0
           Conv2d-17           [-1, 16, 56, 56]             144
      BatchNorm2d-18           [-1, 16, 56, 56]              32
             Mish-19           [-1, 16, 56, 56]               0
        Conv_Mish-20           [-1, 16, 56, 56]               0
           GSConv-21           [-1, 32, 56, 56]               0
           Conv2d-22           [-1, 32, 28, 28]           9,216
      BatchNorm2d-23           [-1, 32, 28, 28]              64
         Identity-24           [-1, 32, 28, 28]               0
        Conv_Mish-25           [-1, 32, 28, 28]               0
           Conv2d-26           [-1, 32, 28, 28]             288
      BatchNorm2d-27           [-1, 32, 28, 28]              64
         Identity-28           [-1, 32, 28, 28]               0
        Conv_Mish-29           [-1, 32, 28, 28]               0
           GSConv-30           [-1, 64, 28, 28]               0
     GSBottleneck-31           [-1, 64, 28, 28]               0
           Conv2d-32           [-1, 32, 28, 28]           2,080
      BatchNorm2d-33           [-1, 32, 28, 28]              64
             ReLU-34           [-1, 32, 28, 28]               0
             Conv-35           [-1, 32, 28, 28]               0
           Conv2d-36           [-1, 16, 28, 28]             512
      BatchNorm2d-37           [-1, 16, 28, 28]              32
             Mish-38           [-1, 16, 28, 28]               0
        Conv_Mish-39           [-1, 16, 28, 28]               0
           Conv2d-40           [-1, 16, 28, 28]             144
      BatchNorm2d-41           [-1, 16, 28, 28]              32
             Mish-42           [-1, 16, 28, 28]               0
        Conv_Mish-43           [-1, 16, 28, 28]               0
           GSConv-44           [-1, 32, 28, 28]               0
           Conv2d-45           [-1, 16, 28, 28]           4,608
      BatchNorm2d-46           [-1, 16, 28, 28]              32
         Identity-47           [-1, 16, 28, 28]               0
        Conv_Mish-48           [-1, 16, 28, 28]               0
           Conv2d-49           [-1, 16, 28, 28]             144
      BatchNorm2d-50           [-1, 16, 28, 28]              32
         Identity-51           [-1, 16, 28, 28]               0
        Conv_Mish-52           [-1, 16, 28, 28]               0
           GSConv-53           [-1, 32, 28, 28]               0
     GSBottleneck-54           [-1, 32, 28, 28]               0
           Conv2d-55           [-1, 32, 28, 28]           2,080
      BatchNorm2d-56           [-1, 32, 28, 28]              64
             ReLU-57           [-1, 32, 28, 28]               0
             Conv-58           [-1, 32, 28, 28]               0
AdaptiveAvgPool2d-59            [-1, 32, 28, 1]               0
AdaptiveAvgPool2d-60            [-1, 32, 1, 28]               0
           Conv2d-61             [-1, 8, 56, 1]             264
      BatchNorm2d-62             [-1, 8, 56, 1]              16
            ReLU6-63             [-1, 8, 56, 1]               0
        h_sigmoid-64             [-1, 8, 56, 1]               0
          h_swish-65             [-1, 8, 56, 1]               0
           Conv2d-66            [-1, 32, 28, 1]             288
           Conv2d-67            [-1, 32, 1, 28]             288
         CoordAtt-68           [-1, 32, 28, 28]               0
           Conv2d-69           [-1, 64, 28, 28]           4,160
      BatchNorm2d-70           [-1, 64, 28, 28]             128
             ReLU-71           [-1, 64, 28, 28]               0
             Conv-72           [-1, 64, 28, 28]               0
AdaptiveAvgPool2d-73            [-1, 64, 28, 1]               0
AdaptiveAvgPool2d-74            [-1, 64, 1, 28]               0
           Conv2d-75             [-1, 8, 56, 1]             520
      BatchNorm2d-76             [-1, 8, 56, 1]              16
            ReLU6-77             [-1, 8, 56, 1]               0
        h_sigmoid-78             [-1, 8, 56, 1]               0
          h_swish-79             [-1, 8, 56, 1]               0
           Conv2d-80            [-1, 64, 28, 1]             576
           Conv2d-81            [-1, 64, 1, 28]             576
         CoordAtt-82           [-1, 64, 28, 28]               0
      VoVGSCSP_CA-83           [-1, 64, 28, 28]               0
           Conv2d-84           [-1, 32, 28, 28]           2,080
      BatchNorm2d-85           [-1, 32, 28, 28]              64
             ReLU-86           [-1, 32, 28, 28]               0
             Conv-87           [-1, 32, 28, 28]               0
           Conv2d-88           [-1, 16, 28, 28]             512
      BatchNorm2d-89           [-1, 16, 28, 28]              32
             Mish-90           [-1, 16, 28, 28]               0
        Conv_Mish-91           [-1, 16, 28, 28]               0
           Conv2d-92           [-1, 16, 28, 28]             144
      BatchNorm2d-93           [-1, 16, 28, 28]              32
             Mish-94           [-1, 16, 28, 28]               0
        Conv_Mish-95           [-1, 16, 28, 28]               0
           GSConv-96           [-1, 32, 28, 28]               0
           Conv2d-97           [-1, 16, 28, 28]           4,608
      BatchNorm2d-98           [-1, 16, 28, 28]              32
         Identity-99           [-1, 16, 28, 28]               0
       Conv_Mish-100           [-1, 16, 28, 28]               0
          Conv2d-101           [-1, 16, 28, 28]             144
     BatchNorm2d-102           [-1, 16, 28, 28]              32
        Identity-103           [-1, 16, 28, 28]               0
       Conv_Mish-104           [-1, 16, 28, 28]               0
          GSConv-105           [-1, 32, 28, 28]               0
    GSBottleneck-106           [-1, 32, 28, 28]               0
          Conv2d-107           [-1, 16, 28, 28]             512
     BatchNorm2d-108           [-1, 16, 28, 28]              32
            Mish-109           [-1, 16, 28, 28]               0
       Conv_Mish-110           [-1, 16, 28, 28]               0
          Conv2d-111           [-1, 16, 28, 28]             144
     BatchNorm2d-112           [-1, 16, 28, 28]              32
            Mish-113           [-1, 16, 28, 28]               0
       Conv_Mish-114           [-1, 16, 28, 28]               0
          GSConv-115           [-1, 32, 28, 28]               0
          Conv2d-116           [-1, 16, 28, 28]           4,608
     BatchNorm2d-117           [-1, 16, 28, 28]              32
        Identity-118           [-1, 16, 28, 28]               0
       Conv_Mish-119           [-1, 16, 28, 28]               0
          Conv2d-120           [-1, 16, 28, 28]             144
     BatchNorm2d-121           [-1, 16, 28, 28]              32
        Identity-122           [-1, 16, 28, 28]               0
       Conv_Mish-123           [-1, 16, 28, 28]               0
          GSConv-124           [-1, 32, 28, 28]               0
    GSBottleneck-125           [-1, 32, 28, 28]               0
          Conv2d-126           [-1, 16, 28, 28]             512
     BatchNorm2d-127           [-1, 16, 28, 28]              32
            Mish-128           [-1, 16, 28, 28]               0
       Conv_Mish-129           [-1, 16, 28, 28]               0
          Conv2d-130           [-1, 16, 28, 28]             144
     BatchNorm2d-131           [-1, 16, 28, 28]              32
            Mish-132           [-1, 16, 28, 28]               0
       Conv_Mish-133           [-1, 16, 28, 28]               0
          GSConv-134           [-1, 32, 28, 28]               0
          Conv2d-135           [-1, 16, 28, 28]           4,608
     BatchNorm2d-136           [-1, 16, 28, 28]              32
        Identity-137           [-1, 16, 28, 28]               0
       Conv_Mish-138           [-1, 16, 28, 28]               0
          Conv2d-139           [-1, 16, 28, 28]             144
     BatchNorm2d-140           [-1, 16, 28, 28]              32
        Identity-141           [-1, 16, 28, 28]               0
       Conv_Mish-142           [-1, 16, 28, 28]               0
          GSConv-143           [-1, 32, 28, 28]               0
    GSBottleneck-144           [-1, 32, 28, 28]               0
          Conv2d-145           [-1, 32, 28, 28]           2,080
     BatchNorm2d-146           [-1, 32, 28, 28]              64
            ReLU-147           [-1, 32, 28, 28]               0
            Conv-148           [-1, 32, 28, 28]               0
AdaptiveAvgPool2d-149            [-1, 32, 28, 1]               0
AdaptiveAvgPool2d-150            [-1, 32, 1, 28]               0
          Conv2d-151             [-1, 8, 56, 1]             264
     BatchNorm2d-152             [-1, 8, 56, 1]              16
           ReLU6-153             [-1, 8, 56, 1]               0
       h_sigmoid-154             [-1, 8, 56, 1]               0
         h_swish-155             [-1, 8, 56, 1]               0
          Conv2d-156            [-1, 32, 28, 1]             288
          Conv2d-157            [-1, 32, 1, 28]             288
        CoordAtt-158           [-1, 32, 28, 28]               0
          Conv2d-159           [-1, 64, 28, 28]           4,160
     BatchNorm2d-160           [-1, 64, 28, 28]             128
            ReLU-161           [-1, 64, 28, 28]               0
            Conv-162           [-1, 64, 28, 28]               0
AdaptiveAvgPool2d-163            [-1, 64, 28, 1]               0
AdaptiveAvgPool2d-164            [-1, 64, 1, 28]               0
          Conv2d-165             [-1, 8, 56, 1]             520
     BatchNorm2d-166             [-1, 8, 56, 1]              16
           ReLU6-167             [-1, 8, 56, 1]               0
       h_sigmoid-168             [-1, 8, 56, 1]               0
         h_swish-169             [-1, 8, 56, 1]               0
          Conv2d-170            [-1, 64, 28, 1]             576
          Conv2d-171            [-1, 64, 1, 28]             576
        CoordAtt-172           [-1, 64, 28, 28]               0
     VoVGSCSP_CA-173           [-1, 64, 28, 28]               0
          Conv2d-174           [-1, 32, 28, 28]           2,080
     BatchNorm2d-175           [-1, 32, 28, 28]              64
            ReLU-176           [-1, 32, 28, 28]               0
            Conv-177           [-1, 32, 28, 28]               0
          Conv2d-178           [-1, 16, 28, 28]             512
     BatchNorm2d-179           [-1, 16, 28, 28]              32
            Mish-180           [-1, 16, 28, 28]               0
       Conv_Mish-181           [-1, 16, 28, 28]               0
          Conv2d-182           [-1, 16, 28, 28]             144
     BatchNorm2d-183           [-1, 16, 28, 28]              32
            Mish-184           [-1, 16, 28, 28]               0
       Conv_Mish-185           [-1, 16, 28, 28]               0
          GSConv-186           [-1, 32, 28, 28]               0
          Conv2d-187           [-1, 16, 28, 28]           4,608
     BatchNorm2d-188           [-1, 16, 28, 28]              32
        Identity-189           [-1, 16, 28, 28]               0
       Conv_Mish-190           [-1, 16, 28, 28]               0
          Conv2d-191           [-1, 16, 28, 28]             144
     BatchNorm2d-192           [-1, 16, 28, 28]              32
        Identity-193           [-1, 16, 28, 28]               0
       Conv_Mish-194           [-1, 16, 28, 28]               0
          GSConv-195           [-1, 32, 28, 28]               0
    GSBottleneck-196           [-1, 32, 28, 28]               0
          Conv2d-197           [-1, 32, 28, 28]           2,080
     BatchNorm2d-198           [-1, 32, 28, 28]              64
            ReLU-199           [-1, 32, 28, 28]               0
            Conv-200           [-1, 32, 28, 28]               0
AdaptiveAvgPool2d-201            [-1, 32, 28, 1]               0
AdaptiveAvgPool2d-202            [-1, 32, 1, 28]               0
          Conv2d-203             [-1, 8, 56, 1]             264
     BatchNorm2d-204             [-1, 8, 56, 1]              16
           ReLU6-205             [-1, 8, 56, 1]               0
       h_sigmoid-206             [-1, 8, 56, 1]               0
         h_swish-207             [-1, 8, 56, 1]               0
          Conv2d-208            [-1, 32, 28, 1]             288
          Conv2d-209            [-1, 32, 1, 28]             288
        CoordAtt-210           [-1, 32, 28, 28]               0
          Conv2d-211           [-1, 64, 28, 28]           4,160
     BatchNorm2d-212           [-1, 64, 28, 28]             128
            ReLU-213           [-1, 64, 28, 28]               0
            Conv-214           [-1, 64, 28, 28]               0
AdaptiveAvgPool2d-215            [-1, 64, 28, 1]               0
AdaptiveAvgPool2d-216            [-1, 64, 1, 28]               0
          Conv2d-217             [-1, 8, 56, 1]             520
     BatchNorm2d-218             [-1, 8, 56, 1]              16
           ReLU6-219             [-1, 8, 56, 1]               0
       h_sigmoid-220             [-1, 8, 56, 1]               0
         h_swish-221             [-1, 8, 56, 1]               0
          Conv2d-222            [-1, 64, 28, 1]             576
          Conv2d-223            [-1, 64, 1, 28]             576
        CoordAtt-224           [-1, 64, 28, 28]               0
     VoVGSCSP_CA-225           [-1, 64, 28, 28]               0
 ConvTranspose2d-226           [-1, 32, 56, 56]          32,800
     BatchNorm2d-227           [-1, 32, 56, 56]              64
           Trans-228           [-1, 32, 56, 56]               0
 ConvTranspose2d-229         [-1, 16, 112, 112]           8,208
     BatchNorm2d-230         [-1, 16, 112, 112]              32
           Trans-231         [-1, 16, 112, 112]               0
 ConvTranspose2d-232         [-1, 16, 225, 225]           4,112
     BatchNorm2d-233         [-1, 16, 225, 225]              32
           Trans-234         [-1, 16, 225, 225]               0
 ConvTranspose2d-235         [-1, 16, 225, 225]          20,752
           Trans-236         [-1, 16, 225, 225]               0
         Dropout-237         [-1, 16, 225, 225]               0
          Conv2d-238          [-1, 1, 224, 224]              65
         Dropout-239         [-1, 16, 225, 225]               0
          Conv2d-240          [-1, 1, 224, 224]              65
         Dropout-241         [-1, 16, 225, 225]               0
          Conv2d-242          [-1, 1, 224, 224]              65
         Dropout-243         [-1, 16, 225, 225]               0
          Conv2d-244          [-1, 1, 224, 224]              65
================================================================
Total params: 166,724
Trainable params: 138,164
Non-trainable params: 28,560
----------------------------------------------------------------
Input size (MB): 0.77
Forward/backward pass size (MB): 135.97
Params size (MB): 0.64
Estimated Total Size (MB): 137.38
----------------------------------------------------------------
