----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 16, 224, 224]           5,200
       BatchNorm2d-2         [-1, 16, 224, 224]              32
              ReLU-3         [-1, 16, 224, 224]               0
              Conv-4         [-1, 16, 224, 224]               0
            Conv2d-5         [-1, 32, 112, 112]           4,640
       BatchNorm2d-6         [-1, 32, 112, 112]              64
              ReLU-7         [-1, 32, 112, 112]               0
              Conv-8         [-1, 32, 112, 112]               0
            Conv2d-9           [-1, 64, 56, 56]          18,496
      BatchNorm2d-10           [-1, 64, 56, 56]             128
             ReLU-11           [-1, 64, 56, 56]               0
             Conv-12           [-1, 64, 56, 56]               0
           Conv2d-13           [-1, 64, 56, 56]           4,096
      BatchNorm2d-14           [-1, 64, 56, 56]             128
             Mish-15           [-1, 64, 56, 56]               0
        Conv_Mish-16           [-1, 64, 56, 56]               0
           Conv2d-17           [-1, 64, 56, 56]             576
      BatchNorm2d-18           [-1, 64, 56, 56]             128
             Mish-19           [-1, 64, 56, 56]               0
        Conv_Mish-20           [-1, 64, 56, 56]               0
           GSConv-21          [-1, 128, 56, 56]               0
           Conv2d-22           [-1, 64, 56, 56]           8,256
      BatchNorm2d-23           [-1, 64, 56, 56]             128
             ReLU-24           [-1, 64, 56, 56]               0
             Conv-25           [-1, 64, 56, 56]               0
           Conv2d-26           [-1, 16, 56, 56]           1,024
      BatchNorm2d-27           [-1, 16, 56, 56]              32
             Mish-28           [-1, 16, 56, 56]               0
        Conv_Mish-29           [-1, 16, 56, 56]               0
           Conv2d-30           [-1, 16, 56, 56]             144
      BatchNorm2d-31           [-1, 16, 56, 56]              32
             Mish-32           [-1, 16, 56, 56]               0
        Conv_Mish-33           [-1, 16, 56, 56]               0
           GSConv-34           [-1, 32, 56, 56]               0
           Conv2d-35           [-1, 32, 56, 56]           9,216
      BatchNorm2d-36           [-1, 32, 56, 56]              64
             ReLU-37           [-1, 32, 56, 56]               0
        Conv_Mish-38           [-1, 32, 56, 56]               0
           Conv2d-39           [-1, 32, 56, 56]             288
      BatchNorm2d-40           [-1, 32, 56, 56]              64
             ReLU-41           [-1, 32, 56, 56]               0
        Conv_Mish-42           [-1, 32, 56, 56]               0
           GSConv-43           [-1, 64, 56, 56]               0
     GSBottleneck-44           [-1, 64, 56, 56]               0
           Conv2d-45           [-1, 64, 56, 56]           8,256
      BatchNorm2d-46           [-1, 64, 56, 56]             128
             ReLU-47           [-1, 64, 56, 56]               0
             Conv-48           [-1, 64, 56, 56]               0
           Conv2d-49          [-1, 128, 56, 56]          16,512
      BatchNorm2d-50          [-1, 128, 56, 56]             256
             ReLU-51          [-1, 128, 56, 56]               0
             Conv-52          [-1, 128, 56, 56]               0
          GS_IRes-53          [-1, 128, 56, 56]               0
           Conv2d-54           [-1, 64, 56, 56]           8,256
      BatchNorm2d-55           [-1, 64, 56, 56]             128
             ReLU-56           [-1, 64, 56, 56]               0
             Conv-57           [-1, 64, 56, 56]               0
           Conv2d-58           [-1, 16, 56, 56]           1,024
      BatchNorm2d-59           [-1, 16, 56, 56]              32
             Mish-60           [-1, 16, 56, 56]               0
        Conv_Mish-61           [-1, 16, 56, 56]               0
           Conv2d-62           [-1, 16, 56, 56]             144
      BatchNorm2d-63           [-1, 16, 56, 56]              32
             Mish-64           [-1, 16, 56, 56]               0
        Conv_Mish-65           [-1, 16, 56, 56]               0
           GSConv-66           [-1, 32, 56, 56]               0
           Conv2d-67           [-1, 32, 56, 56]           9,216
      BatchNorm2d-68           [-1, 32, 56, 56]              64
             ReLU-69           [-1, 32, 56, 56]               0
        Conv_Mish-70           [-1, 32, 56, 56]               0
           Conv2d-71           [-1, 32, 56, 56]             288
      BatchNorm2d-72           [-1, 32, 56, 56]              64
             ReLU-73           [-1, 32, 56, 56]               0
        Conv_Mish-74           [-1, 32, 56, 56]               0
           GSConv-75           [-1, 64, 56, 56]               0
     GSBottleneck-76           [-1, 64, 56, 56]               0
           Conv2d-77           [-1, 16, 56, 56]           1,024
      BatchNorm2d-78           [-1, 16, 56, 56]              32
             Mish-79           [-1, 16, 56, 56]               0
        Conv_Mish-80           [-1, 16, 56, 56]               0
           Conv2d-81           [-1, 16, 56, 56]             144
      BatchNorm2d-82           [-1, 16, 56, 56]              32
             Mish-83           [-1, 16, 56, 56]               0
        Conv_Mish-84           [-1, 16, 56, 56]               0
           GSConv-85           [-1, 32, 56, 56]               0
           Conv2d-86           [-1, 32, 56, 56]           9,216
      BatchNorm2d-87           [-1, 32, 56, 56]              64
             ReLU-88           [-1, 32, 56, 56]               0
        Conv_Mish-89           [-1, 32, 56, 56]               0
           Conv2d-90           [-1, 32, 56, 56]             288
      BatchNorm2d-91           [-1, 32, 56, 56]              64
             ReLU-92           [-1, 32, 56, 56]               0
        Conv_Mish-93           [-1, 32, 56, 56]               0
           GSConv-94           [-1, 64, 56, 56]               0
     GSBottleneck-95           [-1, 64, 56, 56]               0
           Conv2d-96           [-1, 16, 56, 56]           1,024
      BatchNorm2d-97           [-1, 16, 56, 56]              32
             Mish-98           [-1, 16, 56, 56]               0
        Conv_Mish-99           [-1, 16, 56, 56]               0
          Conv2d-100           [-1, 16, 56, 56]             144
     BatchNorm2d-101           [-1, 16, 56, 56]              32
            Mish-102           [-1, 16, 56, 56]               0
       Conv_Mish-103           [-1, 16, 56, 56]               0
          GSConv-104           [-1, 32, 56, 56]               0
          Conv2d-105           [-1, 32, 56, 56]           9,216
     BatchNorm2d-106           [-1, 32, 56, 56]              64
            ReLU-107           [-1, 32, 56, 56]               0
       Conv_Mish-108           [-1, 32, 56, 56]               0
          Conv2d-109           [-1, 32, 56, 56]             288
     BatchNorm2d-110           [-1, 32, 56, 56]              64
            ReLU-111           [-1, 32, 56, 56]               0
       Conv_Mish-112           [-1, 32, 56, 56]               0
          GSConv-113           [-1, 64, 56, 56]               0
    GSBottleneck-114           [-1, 64, 56, 56]               0
          Conv2d-115           [-1, 64, 56, 56]           8,256
     BatchNorm2d-116           [-1, 64, 56, 56]             128
            ReLU-117           [-1, 64, 56, 56]               0
            Conv-118           [-1, 64, 56, 56]               0
          Conv2d-119          [-1, 128, 56, 56]          16,512
     BatchNorm2d-120          [-1, 128, 56, 56]             256
            ReLU-121          [-1, 128, 56, 56]               0
            Conv-122          [-1, 128, 56, 56]               0
         GS_IRes-123          [-1, 128, 56, 56]               0
          Conv2d-124           [-1, 32, 56, 56]           4,128
     BatchNorm2d-125           [-1, 32, 56, 56]              64
            ReLU-126           [-1, 32, 56, 56]               0
            Conv-127           [-1, 32, 56, 56]               0
          Conv2d-128            [-1, 8, 56, 56]             256
     BatchNorm2d-129            [-1, 8, 56, 56]              16
            Mish-130            [-1, 8, 56, 56]               0
       Conv_Mish-131            [-1, 8, 56, 56]               0
          Conv2d-132            [-1, 8, 56, 56]              72
     BatchNorm2d-133            [-1, 8, 56, 56]              16
            Mish-134            [-1, 8, 56, 56]               0
       Conv_Mish-135            [-1, 8, 56, 56]               0
          GSConv-136           [-1, 16, 56, 56]               0
          Conv2d-137           [-1, 16, 56, 56]           2,304
     BatchNorm2d-138           [-1, 16, 56, 56]              32
            ReLU-139           [-1, 16, 56, 56]               0
       Conv_Mish-140           [-1, 16, 56, 56]               0
          Conv2d-141           [-1, 16, 56, 56]             144
     BatchNorm2d-142           [-1, 16, 56, 56]              32
            ReLU-143           [-1, 16, 56, 56]               0
       Conv_Mish-144           [-1, 16, 56, 56]               0
          GSConv-145           [-1, 32, 56, 56]               0
    GSBottleneck-146           [-1, 32, 56, 56]               0
          Conv2d-147           [-1, 32, 56, 56]           4,128
     BatchNorm2d-148           [-1, 32, 56, 56]              64
            ReLU-149           [-1, 32, 56, 56]               0
            Conv-150           [-1, 32, 56, 56]               0
          Conv2d-151          [-1, 128, 56, 56]           8,320
     BatchNorm2d-152          [-1, 128, 56, 56]             256
            ReLU-153          [-1, 128, 56, 56]               0
            Conv-154          [-1, 128, 56, 56]               0
         GS_IRes-155          [-1, 128, 56, 56]               0
          Conv2d-156           [-1, 32, 28, 28]          36,864
     BatchNorm2d-157           [-1, 32, 28, 28]              64
            Mish-158           [-1, 32, 28, 28]               0
       Conv_Mish-159           [-1, 32, 28, 28]               0
          Conv2d-160           [-1, 32, 28, 28]             288
     BatchNorm2d-161           [-1, 32, 28, 28]              64
            Mish-162           [-1, 32, 28, 28]               0
       Conv_Mish-163           [-1, 32, 28, 28]               0
          GSConv-164           [-1, 64, 28, 28]               0
 ConvTranspose2d-165           [-1, 32, 56, 56]          32,800
     BatchNorm2d-166           [-1, 32, 56, 56]              64
           Trans-167           [-1, 32, 56, 56]               0
 ConvTranspose2d-168         [-1, 16, 112, 112]           8,208
     BatchNorm2d-169         [-1, 16, 112, 112]              32
           Trans-170         [-1, 16, 112, 112]               0
 ConvTranspose2d-171         [-1, 16, 225, 225]           4,112
     BatchNorm2d-172         [-1, 16, 225, 225]              32
           Trans-173         [-1, 16, 225, 225]               0
 ConvTranspose2d-174         [-1, 16, 225, 225]          20,752
           Trans-175         [-1, 16, 225, 225]               0
         Dropout-176         [-1, 16, 225, 225]               0
          Conv2d-177          [-1, 1, 224, 224]              65
         Dropout-178         [-1, 16, 225, 225]               0
          Conv2d-179          [-1, 1, 224, 224]              65
         Dropout-180         [-1, 16, 225, 225]               0
          Conv2d-181          [-1, 1, 224, 224]              65
         Dropout-182         [-1, 16, 225, 225]               0
          Conv2d-183          [-1, 1, 224, 224]              65
================================================================
Total params: 267,388
Trainable params: 172,828
Non-trainable params: 94,560
----------------------------------------------------------------
Input size (MB): 0.77
Forward/backward pass size (MB): 259.27
Params size (MB): 1.02
Estimated Total Size (MB): 261.06
----------------------------------------------------------------
