----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 16, 224, 224]             592
       BatchNorm2d-2         [-1, 16, 224, 224]              32
            Conv2d-3         [-1, 32, 112, 112]           8,224
       BatchNorm2d-4         [-1, 32, 112, 112]              64
            Conv2d-5           [-1, 64, 56, 56]          32,832
       BatchNorm2d-6           [-1, 64, 56, 56]             128
            Conv2d-7           [-1, 32, 56, 56]           2,080
       BatchNorm2d-8           [-1, 32, 56, 56]              64
              SiLU-9           [-1, 32, 56, 56]               0
             Conv-10           [-1, 32, 56, 56]               0
           Conv2d-11           [-1, 32, 56, 56]           1,056
      BatchNorm2d-12           [-1, 32, 56, 56]              64
             SiLU-13           [-1, 32, 56, 56]               0
             Conv-14           [-1, 32, 56, 56]               0
           Conv2d-15           [-1, 32, 56, 56]           9,248
      BatchNorm2d-16           [-1, 32, 56, 56]              64
             SiLU-17           [-1, 32, 56, 56]               0
             Conv-18           [-1, 32, 56, 56]               0
       Bottleneck-19           [-1, 32, 56, 56]               0
           Conv2d-20           [-1, 32, 56, 56]           1,056
      BatchNorm2d-21           [-1, 32, 56, 56]              64
             SiLU-22           [-1, 32, 56, 56]               0
             Conv-23           [-1, 32, 56, 56]               0
           Conv2d-24           [-1, 32, 56, 56]           9,248
      BatchNorm2d-25           [-1, 32, 56, 56]              64
             SiLU-26           [-1, 32, 56, 56]               0
             Conv-27           [-1, 32, 56, 56]               0
       Bottleneck-28           [-1, 32, 56, 56]               0
           Conv2d-29           [-1, 32, 56, 56]           1,056
      BatchNorm2d-30           [-1, 32, 56, 56]              64
             SiLU-31           [-1, 32, 56, 56]               0
             Conv-32           [-1, 32, 56, 56]               0
           Conv2d-33           [-1, 32, 56, 56]           9,248
      BatchNorm2d-34           [-1, 32, 56, 56]              64
             SiLU-35           [-1, 32, 56, 56]               0
             Conv-36           [-1, 32, 56, 56]               0
       Bottleneck-37           [-1, 32, 56, 56]               0
           Conv2d-38           [-1, 32, 56, 56]          18,464
      BatchNorm2d-39           [-1, 32, 56, 56]              64
             SiLU-40           [-1, 32, 56, 56]               0
             Conv-41           [-1, 32, 56, 56]               0
           Conv2d-42           [-1, 64, 56, 56]           4,160
      BatchNorm2d-43           [-1, 64, 56, 56]             128
             SiLU-44           [-1, 64, 56, 56]               0
             Conv-45           [-1, 64, 56, 56]               0
AdaptiveAvgPool2d-46            [-1, 64, 56, 1]               0
AdaptiveAvgPool2d-47            [-1, 64, 1, 56]               0
           Conv2d-48            [-1, 8, 112, 1]             520
      BatchNorm2d-49            [-1, 8, 112, 1]              16
            ReLU6-50            [-1, 8, 112, 1]               0
        h_sigmoid-51            [-1, 8, 112, 1]               0
          h_swish-52            [-1, 8, 112, 1]               0
           Conv2d-53            [-1, 64, 56, 1]             576
           Conv2d-54            [-1, 64, 1, 56]             576
         CoordAtt-55           [-1, 64, 56, 56]               0
            C3_CA-56           [-1, 64, 56, 56]               0
           Conv2d-57           [-1, 32, 56, 56]           2,080
      BatchNorm2d-58           [-1, 32, 56, 56]              64
             SiLU-59           [-1, 32, 56, 56]               0
             Conv-60           [-1, 32, 56, 56]               0
           Conv2d-61           [-1, 32, 56, 56]           1,056
      BatchNorm2d-62           [-1, 32, 56, 56]              64
             SiLU-63           [-1, 32, 56, 56]               0
             Conv-64           [-1, 32, 56, 56]               0
           Conv2d-65           [-1, 32, 56, 56]           9,248
      BatchNorm2d-66           [-1, 32, 56, 56]              64
             SiLU-67           [-1, 32, 56, 56]               0
             Conv-68           [-1, 32, 56, 56]               0
       Bottleneck-69           [-1, 32, 56, 56]               0
           Conv2d-70           [-1, 32, 56, 56]           1,056
      BatchNorm2d-71           [-1, 32, 56, 56]              64
             SiLU-72           [-1, 32, 56, 56]               0
             Conv-73           [-1, 32, 56, 56]               0
           Conv2d-74           [-1, 32, 56, 56]           9,248
      BatchNorm2d-75           [-1, 32, 56, 56]              64
             SiLU-76           [-1, 32, 56, 56]               0
             Conv-77           [-1, 32, 56, 56]               0
       Bottleneck-78           [-1, 32, 56, 56]               0
           Conv2d-79           [-1, 32, 56, 56]           1,056
      BatchNorm2d-80           [-1, 32, 56, 56]              64
             SiLU-81           [-1, 32, 56, 56]               0
             Conv-82           [-1, 32, 56, 56]               0
           Conv2d-83           [-1, 32, 56, 56]           9,248
      BatchNorm2d-84           [-1, 32, 56, 56]              64
             SiLU-85           [-1, 32, 56, 56]               0
             Conv-86           [-1, 32, 56, 56]               0
       Bottleneck-87           [-1, 32, 56, 56]               0
           Conv2d-88           [-1, 32, 56, 56]          18,464
      BatchNorm2d-89           [-1, 32, 56, 56]              64
             SiLU-90           [-1, 32, 56, 56]               0
             Conv-91           [-1, 32, 56, 56]               0
           Conv2d-92           [-1, 64, 56, 56]           4,160
      BatchNorm2d-93           [-1, 64, 56, 56]             128
             SiLU-94           [-1, 64, 56, 56]               0
             Conv-95           [-1, 64, 56, 56]               0
AdaptiveAvgPool2d-96            [-1, 64, 56, 1]               0
AdaptiveAvgPool2d-97            [-1, 64, 1, 56]               0
           Conv2d-98            [-1, 8, 112, 1]             520
      BatchNorm2d-99            [-1, 8, 112, 1]              16
           ReLU6-100            [-1, 8, 112, 1]               0
       h_sigmoid-101            [-1, 8, 112, 1]               0
         h_swish-102            [-1, 8, 112, 1]               0
          Conv2d-103            [-1, 64, 56, 1]             576
          Conv2d-104            [-1, 64, 1, 56]             576
        CoordAtt-105           [-1, 64, 56, 56]               0
           C3_CA-106           [-1, 64, 56, 56]               0
 ConvTranspose2d-107         [-1, 32, 113, 113]          32,800
     BatchNorm2d-108         [-1, 32, 113, 113]              64
 ConvTranspose2d-109         [-1, 16, 225, 225]           8,208
     BatchNorm2d-110         [-1, 16, 225, 225]              32
 ConvTranspose2d-111         [-1, 16, 225, 225]          20,752
         Dropout-112         [-1, 16, 225, 225]               0
          Conv2d-113          [-1, 1, 224, 224]              65
         Dropout-114         [-1, 16, 225, 225]               0
          Conv2d-115          [-1, 1, 224, 224]              65
         Dropout-116         [-1, 16, 225, 225]               0
          Conv2d-117          [-1, 1, 224, 224]              65
         Dropout-118         [-1, 16, 225, 225]               0
          Conv2d-119          [-1, 1, 224, 224]              65
================================================================
Total params: 219,876
Trainable params: 219,876
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.77
Forward/backward pass size (MB): 144.72
Params size (MB): 0.84
Estimated Total Size (MB): 146.32
----------------------------------------------------------------
