----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1          [-1, 4, 224, 224]             196
       BatchNorm2d-2          [-1, 4, 224, 224]               8
              Mish-3          [-1, 4, 224, 224]               0
         Conv_Mish-4          [-1, 4, 224, 224]               0
            Conv2d-5          [-1, 8, 224, 224]           1,568
       BatchNorm2d-6          [-1, 8, 224, 224]              16
              Mish-7          [-1, 8, 224, 224]               0
         Conv_Mish-8          [-1, 8, 224, 224]               0
            Conv2d-9          [-1, 8, 224, 224]              72
      BatchNorm2d-10          [-1, 8, 224, 224]              16
             Mish-11          [-1, 8, 224, 224]               0
        Conv_Mish-12          [-1, 8, 224, 224]               0
           GSConv-13         [-1, 16, 224, 224]               0
AdaptiveAvgPool2d-14           [-1, 16, 224, 1]               0
AdaptiveAvgPool2d-15           [-1, 16, 1, 224]               0
           Conv2d-16            [-1, 8, 448, 1]             136
      BatchNorm2d-17            [-1, 8, 448, 1]              16
            ReLU6-18            [-1, 8, 448, 1]               0
        h_sigmoid-19            [-1, 8, 448, 1]               0
          h_swish-20            [-1, 8, 448, 1]               0
           Conv2d-21           [-1, 16, 224, 1]             144
           Conv2d-22           [-1, 16, 1, 224]             144
         CoordAtt-23         [-1, 16, 224, 224]               0
             ReLU-24         [-1, 16, 224, 224]               0
       MultiModal-25         [-1, 16, 224, 224]               0
           Conv2d-26         [-1, 32, 112, 112]           8,224
      BatchNorm2d-27         [-1, 32, 112, 112]              64
             ReLU-28         [-1, 32, 112, 112]               0
             Conv-29         [-1, 32, 112, 112]               0
           Conv2d-30           [-1, 64, 56, 56]          32,832
      BatchNorm2d-31           [-1, 64, 56, 56]             128
             ReLU-32           [-1, 64, 56, 56]               0
             Conv-33           [-1, 64, 56, 56]               0
           Conv2d-34           [-1, 32, 56, 56]           2,080
      BatchNorm2d-35           [-1, 32, 56, 56]              64
             ReLU-36           [-1, 32, 56, 56]               0
             Conv-37           [-1, 32, 56, 56]               0
           Conv2d-38            [-1, 8, 56, 56]             256
      BatchNorm2d-39            [-1, 8, 56, 56]              16
             Mish-40            [-1, 8, 56, 56]               0
        Conv_Mish-41            [-1, 8, 56, 56]               0
           Conv2d-42            [-1, 8, 56, 56]              72
      BatchNorm2d-43            [-1, 8, 56, 56]              16
             Mish-44            [-1, 8, 56, 56]               0
        Conv_Mish-45            [-1, 8, 56, 56]               0
           GSConv-46           [-1, 16, 56, 56]               0
           Conv2d-47           [-1, 16, 56, 56]           2,304
      BatchNorm2d-48           [-1, 16, 56, 56]              32
             Mish-49           [-1, 16, 56, 56]               0
        Conv_Mish-50           [-1, 16, 56, 56]               0
           Conv2d-51           [-1, 16, 56, 56]             144
      BatchNorm2d-52           [-1, 16, 56, 56]              32
             Mish-53           [-1, 16, 56, 56]               0
        Conv_Mish-54           [-1, 16, 56, 56]               0
           GSConv-55           [-1, 32, 56, 56]               0
     GSBottleneck-56           [-1, 32, 56, 56]               0
           Conv2d-57            [-1, 8, 56, 56]             256
      BatchNorm2d-58            [-1, 8, 56, 56]              16
             Mish-59            [-1, 8, 56, 56]               0
        Conv_Mish-60            [-1, 8, 56, 56]               0
           Conv2d-61            [-1, 8, 56, 56]              72
      BatchNorm2d-62            [-1, 8, 56, 56]              16
             Mish-63            [-1, 8, 56, 56]               0
        Conv_Mish-64            [-1, 8, 56, 56]               0
           GSConv-65           [-1, 16, 56, 56]               0
           Conv2d-66           [-1, 16, 56, 56]           2,304
      BatchNorm2d-67           [-1, 16, 56, 56]              32
             Mish-68           [-1, 16, 56, 56]               0
        Conv_Mish-69           [-1, 16, 56, 56]               0
           Conv2d-70           [-1, 16, 56, 56]             144
      BatchNorm2d-71           [-1, 16, 56, 56]              32
             Mish-72           [-1, 16, 56, 56]               0
        Conv_Mish-73           [-1, 16, 56, 56]               0
           GSConv-74           [-1, 32, 56, 56]               0
     GSBottleneck-75           [-1, 32, 56, 56]               0
           Conv2d-76           [-1, 32, 56, 56]           2,080
      BatchNorm2d-77           [-1, 32, 56, 56]              64
             ReLU-78           [-1, 32, 56, 56]               0
             Conv-79           [-1, 32, 56, 56]               0
           Conv2d-80           [-1, 32, 56, 56]           9,248
      BatchNorm2d-81           [-1, 32, 56, 56]              64
             ReLU-82           [-1, 32, 56, 56]               0
             Conv-83           [-1, 32, 56, 56]               0
           Conv2d-84           [-1, 32, 56, 56]           9,248
      BatchNorm2d-85           [-1, 32, 56, 56]              64
             ReLU-86           [-1, 32, 56, 56]               0
             Conv-87           [-1, 32, 56, 56]               0
           Conv2d-88           [-1, 32, 56, 56]           2,080
      BatchNorm2d-89           [-1, 32, 56, 56]              64
             ReLU-90           [-1, 32, 56, 56]               0
             Conv-91           [-1, 32, 56, 56]               0
           Conv2d-92           [-1, 64, 56, 56]           6,208
      BatchNorm2d-93           [-1, 64, 56, 56]             128
             ReLU-94           [-1, 64, 56, 56]               0
             Conv-95           [-1, 64, 56, 56]               0
AdaptiveAvgPool2d-96            [-1, 64, 56, 1]               0
AdaptiveAvgPool2d-97            [-1, 64, 1, 56]               0
           Conv2d-98            [-1, 8, 112, 1]             520
      BatchNorm2d-99            [-1, 8, 112, 1]              16
           ReLU6-100            [-1, 8, 112, 1]               0
       h_sigmoid-101            [-1, 8, 112, 1]               0
         h_swish-102            [-1, 8, 112, 1]               0
          Conv2d-103            [-1, 64, 56, 1]             576
          Conv2d-104            [-1, 64, 1, 56]             576
        CoordAtt-105           [-1, 64, 56, 56]               0
            ReLU-106           [-1, 64, 56, 56]               0
      CA_GS_IRes-107           [-1, 64, 56, 56]               0
          Conv2d-108           [-1, 32, 56, 56]           2,080
     BatchNorm2d-109           [-1, 32, 56, 56]              64
            ReLU-110           [-1, 32, 56, 56]               0
            Conv-111           [-1, 32, 56, 56]               0
          Conv2d-112            [-1, 8, 56, 56]             256
     BatchNorm2d-113            [-1, 8, 56, 56]              16
            Mish-114            [-1, 8, 56, 56]               0
       Conv_Mish-115            [-1, 8, 56, 56]               0
          Conv2d-116            [-1, 8, 56, 56]              72
     BatchNorm2d-117            [-1, 8, 56, 56]              16
            Mish-118            [-1, 8, 56, 56]               0
       Conv_Mish-119            [-1, 8, 56, 56]               0
          GSConv-120           [-1, 16, 56, 56]               0
          Conv2d-121           [-1, 16, 56, 56]           2,304
     BatchNorm2d-122           [-1, 16, 56, 56]              32
            Mish-123           [-1, 16, 56, 56]               0
       Conv_Mish-124           [-1, 16, 56, 56]               0
          Conv2d-125           [-1, 16, 56, 56]             144
     BatchNorm2d-126           [-1, 16, 56, 56]              32
            Mish-127           [-1, 16, 56, 56]               0
       Conv_Mish-128           [-1, 16, 56, 56]               0
          GSConv-129           [-1, 32, 56, 56]               0
    GSBottleneck-130           [-1, 32, 56, 56]               0
          Conv2d-131            [-1, 8, 56, 56]             256
     BatchNorm2d-132            [-1, 8, 56, 56]              16
            Mish-133            [-1, 8, 56, 56]               0
       Conv_Mish-134            [-1, 8, 56, 56]               0
          Conv2d-135            [-1, 8, 56, 56]              72
     BatchNorm2d-136            [-1, 8, 56, 56]              16
            Mish-137            [-1, 8, 56, 56]               0
       Conv_Mish-138            [-1, 8, 56, 56]               0
          GSConv-139           [-1, 16, 56, 56]               0
          Conv2d-140           [-1, 16, 56, 56]           2,304
     BatchNorm2d-141           [-1, 16, 56, 56]              32
            Mish-142           [-1, 16, 56, 56]               0
       Conv_Mish-143           [-1, 16, 56, 56]               0
          Conv2d-144           [-1, 16, 56, 56]             144
     BatchNorm2d-145           [-1, 16, 56, 56]              32
            Mish-146           [-1, 16, 56, 56]               0
       Conv_Mish-147           [-1, 16, 56, 56]               0
          GSConv-148           [-1, 32, 56, 56]               0
    GSBottleneck-149           [-1, 32, 56, 56]               0
          Conv2d-150           [-1, 32, 56, 56]           2,080
     BatchNorm2d-151           [-1, 32, 56, 56]              64
            ReLU-152           [-1, 32, 56, 56]               0
            Conv-153           [-1, 32, 56, 56]               0
          Conv2d-154           [-1, 32, 56, 56]           9,248
     BatchNorm2d-155           [-1, 32, 56, 56]              64
            ReLU-156           [-1, 32, 56, 56]               0
            Conv-157           [-1, 32, 56, 56]               0
          Conv2d-158           [-1, 32, 56, 56]           9,248
     BatchNorm2d-159           [-1, 32, 56, 56]              64
            ReLU-160           [-1, 32, 56, 56]               0
            Conv-161           [-1, 32, 56, 56]               0
          Conv2d-162           [-1, 32, 56, 56]           2,080
     BatchNorm2d-163           [-1, 32, 56, 56]              64
            ReLU-164           [-1, 32, 56, 56]               0
            Conv-165           [-1, 32, 56, 56]               0
          Conv2d-166           [-1, 64, 56, 56]           6,208
     BatchNorm2d-167           [-1, 64, 56, 56]             128
            ReLU-168           [-1, 64, 56, 56]               0
            Conv-169           [-1, 64, 56, 56]               0
AdaptiveAvgPool2d-170            [-1, 64, 56, 1]               0
AdaptiveAvgPool2d-171            [-1, 64, 1, 56]               0
          Conv2d-172            [-1, 8, 112, 1]             520
     BatchNorm2d-173            [-1, 8, 112, 1]              16
           ReLU6-174            [-1, 8, 112, 1]               0
       h_sigmoid-175            [-1, 8, 112, 1]               0
         h_swish-176            [-1, 8, 112, 1]               0
          Conv2d-177            [-1, 64, 56, 1]             576
          Conv2d-178            [-1, 64, 1, 56]             576
        CoordAtt-179           [-1, 64, 56, 56]               0
            ReLU-180           [-1, 64, 56, 56]               0
      CA_GS_IRes-181           [-1, 64, 56, 56]               0
          Conv2d-182           [-1, 32, 56, 56]           2,080
     BatchNorm2d-183           [-1, 32, 56, 56]              64
            ReLU-184           [-1, 32, 56, 56]               0
            Conv-185           [-1, 32, 56, 56]               0
          Conv2d-186            [-1, 8, 56, 56]             256
     BatchNorm2d-187            [-1, 8, 56, 56]              16
            Mish-188            [-1, 8, 56, 56]               0
       Conv_Mish-189            [-1, 8, 56, 56]               0
          Conv2d-190            [-1, 8, 56, 56]              72
     BatchNorm2d-191            [-1, 8, 56, 56]              16
            Mish-192            [-1, 8, 56, 56]               0
       Conv_Mish-193            [-1, 8, 56, 56]               0
          GSConv-194           [-1, 16, 56, 56]               0
          Conv2d-195           [-1, 16, 56, 56]           2,304
     BatchNorm2d-196           [-1, 16, 56, 56]              32
            Mish-197           [-1, 16, 56, 56]               0
       Conv_Mish-198           [-1, 16, 56, 56]               0
          Conv2d-199           [-1, 16, 56, 56]             144
     BatchNorm2d-200           [-1, 16, 56, 56]              32
            Mish-201           [-1, 16, 56, 56]               0
       Conv_Mish-202           [-1, 16, 56, 56]               0
          GSConv-203           [-1, 32, 56, 56]               0
    GSBottleneck-204           [-1, 32, 56, 56]               0
          Conv2d-205            [-1, 8, 56, 56]             256
     BatchNorm2d-206            [-1, 8, 56, 56]              16
            Mish-207            [-1, 8, 56, 56]               0
       Conv_Mish-208            [-1, 8, 56, 56]               0
          Conv2d-209            [-1, 8, 56, 56]              72
     BatchNorm2d-210            [-1, 8, 56, 56]              16
            Mish-211            [-1, 8, 56, 56]               0
       Conv_Mish-212            [-1, 8, 56, 56]               0
          GSConv-213           [-1, 16, 56, 56]               0
          Conv2d-214           [-1, 16, 56, 56]           2,304
     BatchNorm2d-215           [-1, 16, 56, 56]              32
            Mish-216           [-1, 16, 56, 56]               0
       Conv_Mish-217           [-1, 16, 56, 56]               0
          Conv2d-218           [-1, 16, 56, 56]             144
     BatchNorm2d-219           [-1, 16, 56, 56]              32
            Mish-220           [-1, 16, 56, 56]               0
       Conv_Mish-221           [-1, 16, 56, 56]               0
          GSConv-222           [-1, 32, 56, 56]               0
    GSBottleneck-223           [-1, 32, 56, 56]               0
          Conv2d-224           [-1, 32, 56, 56]           2,080
     BatchNorm2d-225           [-1, 32, 56, 56]              64
            ReLU-226           [-1, 32, 56, 56]               0
            Conv-227           [-1, 32, 56, 56]               0
          Conv2d-228           [-1, 32, 56, 56]           9,248
     BatchNorm2d-229           [-1, 32, 56, 56]              64
            ReLU-230           [-1, 32, 56, 56]               0
            Conv-231           [-1, 32, 56, 56]               0
          Conv2d-232           [-1, 32, 56, 56]           9,248
     BatchNorm2d-233           [-1, 32, 56, 56]              64
            ReLU-234           [-1, 32, 56, 56]               0
            Conv-235           [-1, 32, 56, 56]               0
          Conv2d-236           [-1, 32, 56, 56]           2,080
     BatchNorm2d-237           [-1, 32, 56, 56]              64
            ReLU-238           [-1, 32, 56, 56]               0
            Conv-239           [-1, 32, 56, 56]               0
          Conv2d-240           [-1, 64, 56, 56]           6,208
     BatchNorm2d-241           [-1, 64, 56, 56]             128
            ReLU-242           [-1, 64, 56, 56]               0
            Conv-243           [-1, 64, 56, 56]               0
AdaptiveAvgPool2d-244            [-1, 64, 56, 1]               0
AdaptiveAvgPool2d-245            [-1, 64, 1, 56]               0
          Conv2d-246            [-1, 8, 112, 1]             520
     BatchNorm2d-247            [-1, 8, 112, 1]              16
           ReLU6-248            [-1, 8, 112, 1]               0
       h_sigmoid-249            [-1, 8, 112, 1]               0
         h_swish-250            [-1, 8, 112, 1]               0
          Conv2d-251            [-1, 64, 56, 1]             576
          Conv2d-252            [-1, 64, 1, 56]             576
        CoordAtt-253           [-1, 64, 56, 56]               0
            ReLU-254           [-1, 64, 56, 56]               0
      CA_GS_IRes-255           [-1, 64, 56, 56]               0
 ConvTranspose2d-256         [-1, 32, 113, 113]          32,800
     BatchNorm2d-257         [-1, 32, 113, 113]              64
           Trans-258         [-1, 32, 113, 113]               0
 ConvTranspose2d-259         [-1, 16, 225, 225]           8,208
     BatchNorm2d-260         [-1, 16, 225, 225]              32
           Trans-261         [-1, 16, 225, 225]               0
 ConvTranspose2d-262         [-1, 16, 225, 225]          20,752
           Trans-263         [-1, 16, 225, 225]               0
         Dropout-264         [-1, 16, 225, 225]               0
          Conv2d-265          [-1, 1, 224, 224]              65
         Dropout-266         [-1, 16, 225, 225]               0
          Conv2d-267          [-1, 1, 224, 224]              65
         Dropout-268         [-1, 16, 225, 225]               0
          Conv2d-269          [-1, 1, 224, 224]              65
         Dropout-270         [-1, 16, 225, 225]               0
          Conv2d-271          [-1, 1, 224, 224]              65
================================================================
Total params: 222,152
Trainable params: 119,048
Non-trainable params: 103,104
----------------------------------------------------------------
Input size (MB): 0.77
Forward/backward pass size (MB): 257.82
Params size (MB): 0.85
Estimated Total Size (MB): 259.43
----------------------------------------------------------------
