----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 16, 224, 224]           1,312
       BatchNorm2d-2         [-1, 16, 224, 224]              32
              ReLU-3         [-1, 16, 224, 224]               0
              Conv-4         [-1, 16, 224, 224]               0
            Conv2d-5         [-1, 32, 112, 112]           8,224
       BatchNorm2d-6         [-1, 32, 112, 112]              64
              ReLU-7         [-1, 32, 112, 112]               0
              Conv-8         [-1, 32, 112, 112]               0
            Conv2d-9           [-1, 64, 56, 56]          32,832
      BatchNorm2d-10           [-1, 64, 56, 56]             128
             ReLU-11           [-1, 64, 56, 56]               0
             Conv-12           [-1, 64, 56, 56]               0
           Conv2d-13           [-1, 32, 56, 56]           2,080
      BatchNorm2d-14           [-1, 32, 56, 56]              64
             ReLU-15           [-1, 32, 56, 56]               0
             Conv-16           [-1, 32, 56, 56]               0
           Conv2d-17            [-1, 8, 56, 56]             256
      BatchNorm2d-18            [-1, 8, 56, 56]              16
             Mish-19            [-1, 8, 56, 56]               0
        Conv_Mish-20            [-1, 8, 56, 56]               0
           Conv2d-21            [-1, 8, 56, 56]              72
      BatchNorm2d-22            [-1, 8, 56, 56]              16
             Mish-23            [-1, 8, 56, 56]               0
        Conv_Mish-24            [-1, 8, 56, 56]               0
           GSConv-25           [-1, 16, 56, 56]               0
           Conv2d-26           [-1, 16, 56, 56]           2,304
      BatchNorm2d-27           [-1, 16, 56, 56]              32
             Mish-28           [-1, 16, 56, 56]               0
        Conv_Mish-29           [-1, 16, 56, 56]               0
           Conv2d-30           [-1, 16, 56, 56]             144
      BatchNorm2d-31           [-1, 16, 56, 56]              32
             Mish-32           [-1, 16, 56, 56]               0
        Conv_Mish-33           [-1, 16, 56, 56]               0
           GSConv-34           [-1, 32, 56, 56]               0
     GSBottleneck-35           [-1, 32, 56, 56]               0
           Conv2d-36            [-1, 8, 56, 56]             256
      BatchNorm2d-37            [-1, 8, 56, 56]              16
             Mish-38            [-1, 8, 56, 56]               0
        Conv_Mish-39            [-1, 8, 56, 56]               0
           Conv2d-40            [-1, 8, 56, 56]              72
      BatchNorm2d-41            [-1, 8, 56, 56]              16
             Mish-42            [-1, 8, 56, 56]               0
        Conv_Mish-43            [-1, 8, 56, 56]               0
           GSConv-44           [-1, 16, 56, 56]               0
           Conv2d-45           [-1, 16, 56, 56]           2,304
      BatchNorm2d-46           [-1, 16, 56, 56]              32
             Mish-47           [-1, 16, 56, 56]               0
        Conv_Mish-48           [-1, 16, 56, 56]               0
           Conv2d-49           [-1, 16, 56, 56]             144
      BatchNorm2d-50           [-1, 16, 56, 56]              32
             Mish-51           [-1, 16, 56, 56]               0
        Conv_Mish-52           [-1, 16, 56, 56]               0
           GSConv-53           [-1, 32, 56, 56]               0
     GSBottleneck-54           [-1, 32, 56, 56]               0
           Conv2d-55           [-1, 32, 56, 56]           2,080
      BatchNorm2d-56           [-1, 32, 56, 56]              64
             ReLU-57           [-1, 32, 56, 56]               0
             Conv-58           [-1, 32, 56, 56]               0
           Conv2d-59           [-1, 32, 56, 56]           9,248
      BatchNorm2d-60           [-1, 32, 56, 56]              64
             ReLU-61           [-1, 32, 56, 56]               0
             Conv-62           [-1, 32, 56, 56]               0
           Conv2d-63           [-1, 32, 56, 56]           9,248
      BatchNorm2d-64           [-1, 32, 56, 56]              64
             ReLU-65           [-1, 32, 56, 56]               0
             Conv-66           [-1, 32, 56, 56]               0
           Conv2d-67           [-1, 32, 56, 56]           2,080
      BatchNorm2d-68           [-1, 32, 56, 56]              64
             ReLU-69           [-1, 32, 56, 56]               0
             Conv-70           [-1, 32, 56, 56]               0
           Conv2d-71           [-1, 64, 56, 56]           6,208
      BatchNorm2d-72           [-1, 64, 56, 56]             128
             ReLU-73           [-1, 64, 56, 56]               0
             Conv-74           [-1, 64, 56, 56]               0
AdaptiveAvgPool2d-75            [-1, 64, 56, 1]               0
AdaptiveAvgPool2d-76            [-1, 64, 1, 56]               0
           Conv2d-77            [-1, 8, 112, 1]             520
      BatchNorm2d-78            [-1, 8, 112, 1]              16
            ReLU6-79            [-1, 8, 112, 1]               0
        h_sigmoid-80            [-1, 8, 112, 1]               0
          h_swish-81            [-1, 8, 112, 1]               0
           Conv2d-82            [-1, 64, 56, 1]             576
           Conv2d-83            [-1, 64, 1, 56]             576
         CoordAtt-84           [-1, 64, 56, 56]               0
             ReLU-85           [-1, 64, 56, 56]               0
       CA_GS_IRes-86           [-1, 64, 56, 56]               0
           Conv2d-87           [-1, 32, 56, 56]           2,080
      BatchNorm2d-88           [-1, 32, 56, 56]              64
             ReLU-89           [-1, 32, 56, 56]               0
             Conv-90           [-1, 32, 56, 56]               0
           Conv2d-91            [-1, 8, 56, 56]             256
      BatchNorm2d-92            [-1, 8, 56, 56]              16
             Mish-93            [-1, 8, 56, 56]               0
        Conv_Mish-94            [-1, 8, 56, 56]               0
           Conv2d-95            [-1, 8, 56, 56]              72
      BatchNorm2d-96            [-1, 8, 56, 56]              16
             Mish-97            [-1, 8, 56, 56]               0
        Conv_Mish-98            [-1, 8, 56, 56]               0
           GSConv-99           [-1, 16, 56, 56]               0
          Conv2d-100           [-1, 16, 56, 56]           2,304
     BatchNorm2d-101           [-1, 16, 56, 56]              32
            Mish-102           [-1, 16, 56, 56]               0
       Conv_Mish-103           [-1, 16, 56, 56]               0
          Conv2d-104           [-1, 16, 56, 56]             144
     BatchNorm2d-105           [-1, 16, 56, 56]              32
            Mish-106           [-1, 16, 56, 56]               0
       Conv_Mish-107           [-1, 16, 56, 56]               0
          GSConv-108           [-1, 32, 56, 56]               0
    GSBottleneck-109           [-1, 32, 56, 56]               0
          Conv2d-110            [-1, 8, 56, 56]             256
     BatchNorm2d-111            [-1, 8, 56, 56]              16
            Mish-112            [-1, 8, 56, 56]               0
       Conv_Mish-113            [-1, 8, 56, 56]               0
          Conv2d-114            [-1, 8, 56, 56]              72
     BatchNorm2d-115            [-1, 8, 56, 56]              16
            Mish-116            [-1, 8, 56, 56]               0
       Conv_Mish-117            [-1, 8, 56, 56]               0
          GSConv-118           [-1, 16, 56, 56]               0
          Conv2d-119           [-1, 16, 56, 56]           2,304
     BatchNorm2d-120           [-1, 16, 56, 56]              32
            Mish-121           [-1, 16, 56, 56]               0
       Conv_Mish-122           [-1, 16, 56, 56]               0
          Conv2d-123           [-1, 16, 56, 56]             144
     BatchNorm2d-124           [-1, 16, 56, 56]              32
            Mish-125           [-1, 16, 56, 56]               0
       Conv_Mish-126           [-1, 16, 56, 56]               0
          GSConv-127           [-1, 32, 56, 56]               0
    GSBottleneck-128           [-1, 32, 56, 56]               0
          Conv2d-129           [-1, 32, 56, 56]           2,080
     BatchNorm2d-130           [-1, 32, 56, 56]              64
            ReLU-131           [-1, 32, 56, 56]               0
            Conv-132           [-1, 32, 56, 56]               0
          Conv2d-133           [-1, 32, 56, 56]           9,248
     BatchNorm2d-134           [-1, 32, 56, 56]              64
            ReLU-135           [-1, 32, 56, 56]               0
            Conv-136           [-1, 32, 56, 56]               0
          Conv2d-137           [-1, 32, 56, 56]           9,248
     BatchNorm2d-138           [-1, 32, 56, 56]              64
            ReLU-139           [-1, 32, 56, 56]               0
            Conv-140           [-1, 32, 56, 56]               0
          Conv2d-141           [-1, 32, 56, 56]           2,080
     BatchNorm2d-142           [-1, 32, 56, 56]              64
            ReLU-143           [-1, 32, 56, 56]               0
            Conv-144           [-1, 32, 56, 56]               0
          Conv2d-145           [-1, 64, 56, 56]           6,208
     BatchNorm2d-146           [-1, 64, 56, 56]             128
            ReLU-147           [-1, 64, 56, 56]               0
            Conv-148           [-1, 64, 56, 56]               0
AdaptiveAvgPool2d-149            [-1, 64, 56, 1]               0
AdaptiveAvgPool2d-150            [-1, 64, 1, 56]               0
          Conv2d-151            [-1, 8, 112, 1]             520
     BatchNorm2d-152            [-1, 8, 112, 1]              16
           ReLU6-153            [-1, 8, 112, 1]               0
       h_sigmoid-154            [-1, 8, 112, 1]               0
         h_swish-155            [-1, 8, 112, 1]               0
          Conv2d-156            [-1, 64, 56, 1]             576
          Conv2d-157            [-1, 64, 1, 56]             576
        CoordAtt-158           [-1, 64, 56, 56]               0
            ReLU-159           [-1, 64, 56, 56]               0
      CA_GS_IRes-160           [-1, 64, 56, 56]               0
          Conv2d-161           [-1, 32, 56, 56]           2,080
     BatchNorm2d-162           [-1, 32, 56, 56]              64
            ReLU-163           [-1, 32, 56, 56]               0
            Conv-164           [-1, 32, 56, 56]               0
          Conv2d-165            [-1, 8, 56, 56]             256
     BatchNorm2d-166            [-1, 8, 56, 56]              16
            Mish-167            [-1, 8, 56, 56]               0
       Conv_Mish-168            [-1, 8, 56, 56]               0
          Conv2d-169            [-1, 8, 56, 56]              72
     BatchNorm2d-170            [-1, 8, 56, 56]              16
            Mish-171            [-1, 8, 56, 56]               0
       Conv_Mish-172            [-1, 8, 56, 56]               0
          GSConv-173           [-1, 16, 56, 56]               0
          Conv2d-174           [-1, 16, 56, 56]           2,304
     BatchNorm2d-175           [-1, 16, 56, 56]              32
            Mish-176           [-1, 16, 56, 56]               0
       Conv_Mish-177           [-1, 16, 56, 56]               0
          Conv2d-178           [-1, 16, 56, 56]             144
     BatchNorm2d-179           [-1, 16, 56, 56]              32
            Mish-180           [-1, 16, 56, 56]               0
       Conv_Mish-181           [-1, 16, 56, 56]               0
          GSConv-182           [-1, 32, 56, 56]               0
    GSBottleneck-183           [-1, 32, 56, 56]               0
          Conv2d-184            [-1, 8, 56, 56]             256
     BatchNorm2d-185            [-1, 8, 56, 56]              16
            Mish-186            [-1, 8, 56, 56]               0
       Conv_Mish-187            [-1, 8, 56, 56]               0
          Conv2d-188            [-1, 8, 56, 56]              72
     BatchNorm2d-189            [-1, 8, 56, 56]              16
            Mish-190            [-1, 8, 56, 56]               0
       Conv_Mish-191            [-1, 8, 56, 56]               0
          GSConv-192           [-1, 16, 56, 56]               0
          Conv2d-193           [-1, 16, 56, 56]           2,304
     BatchNorm2d-194           [-1, 16, 56, 56]              32
            Mish-195           [-1, 16, 56, 56]               0
       Conv_Mish-196           [-1, 16, 56, 56]               0
          Conv2d-197           [-1, 16, 56, 56]             144
     BatchNorm2d-198           [-1, 16, 56, 56]              32
            Mish-199           [-1, 16, 56, 56]               0
       Conv_Mish-200           [-1, 16, 56, 56]               0
          GSConv-201           [-1, 32, 56, 56]               0
    GSBottleneck-202           [-1, 32, 56, 56]               0
          Conv2d-203           [-1, 32, 56, 56]           2,080
     BatchNorm2d-204           [-1, 32, 56, 56]              64
            ReLU-205           [-1, 32, 56, 56]               0
            Conv-206           [-1, 32, 56, 56]               0
          Conv2d-207           [-1, 32, 56, 56]           9,248
     BatchNorm2d-208           [-1, 32, 56, 56]              64
            ReLU-209           [-1, 32, 56, 56]               0
            Conv-210           [-1, 32, 56, 56]               0
          Conv2d-211           [-1, 32, 56, 56]           9,248
     BatchNorm2d-212           [-1, 32, 56, 56]              64
            ReLU-213           [-1, 32, 56, 56]               0
            Conv-214           [-1, 32, 56, 56]               0
          Conv2d-215           [-1, 32, 56, 56]           2,080
     BatchNorm2d-216           [-1, 32, 56, 56]              64
            ReLU-217           [-1, 32, 56, 56]               0
            Conv-218           [-1, 32, 56, 56]               0
          Conv2d-219           [-1, 64, 56, 56]           6,208
     BatchNorm2d-220           [-1, 64, 56, 56]             128
            ReLU-221           [-1, 64, 56, 56]               0
            Conv-222           [-1, 64, 56, 56]               0
AdaptiveAvgPool2d-223            [-1, 64, 56, 1]               0
AdaptiveAvgPool2d-224            [-1, 64, 1, 56]               0
          Conv2d-225            [-1, 8, 112, 1]             520
     BatchNorm2d-226            [-1, 8, 112, 1]              16
           ReLU6-227            [-1, 8, 112, 1]               0
       h_sigmoid-228            [-1, 8, 112, 1]               0
         h_swish-229            [-1, 8, 112, 1]               0
          Conv2d-230            [-1, 64, 56, 1]             576
          Conv2d-231            [-1, 64, 1, 56]             576
        CoordAtt-232           [-1, 64, 56, 56]               0
            ReLU-233           [-1, 64, 56, 56]               0
      CA_GS_IRes-234           [-1, 64, 56, 56]               0
 ConvTranspose2d-235         [-1, 32, 113, 113]          32,800
     BatchNorm2d-236         [-1, 32, 113, 113]              64
           Trans-237         [-1, 32, 113, 113]               0
 ConvTranspose2d-238         [-1, 16, 225, 225]           8,208
     BatchNorm2d-239         [-1, 16, 225, 225]              32
           Trans-240         [-1, 16, 225, 225]               0
 ConvTranspose2d-241         [-1, 16, 225, 225]          20,752
           Trans-242         [-1, 16, 225, 225]               0
         Dropout-243         [-1, 16, 225, 225]               0
          Conv2d-244          [-1, 1, 224, 224]              65
         Dropout-245         [-1, 16, 225, 225]               0
          Conv2d-246          [-1, 1, 224, 224]              65
         Dropout-247         [-1, 16, 225, 225]               0
          Conv2d-248          [-1, 1, 224, 224]              65
         Dropout-249         [-1, 16, 225, 225]               0
          Conv2d-250          [-1, 1, 224, 224]              65
================================================================
Total params: 221,180
Trainable params: 116,732
Non-trainable params: 104,448
----------------------------------------------------------------
Input size (MB): 0.19
Forward/backward pass size (MB): 226.95
Params size (MB): 0.84
Estimated Total Size (MB): 227.98
----------------------------------------------------------------
