----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 16, 224, 224]           5,200
       BatchNorm2d-2         [-1, 16, 224, 224]              32
            Conv2d-3         [-1, 32, 112, 112]           8,224
       BatchNorm2d-4         [-1, 32, 112, 112]              64
            Conv2d-5           [-1, 64, 56, 56]          32,832
       BatchNorm2d-6           [-1, 64, 56, 56]             128
            Conv2d-7           [-1, 64, 56, 56]          36,928
       BatchNorm2d-8           [-1, 64, 56, 56]             128
              ReLU-9           [-1, 64, 56, 56]               0
           Conv2d-10           [-1, 64, 56, 56]          36,928
      BatchNorm2d-11           [-1, 64, 56, 56]             128
AdaptiveAvgPool2d-12            [-1, 64, 56, 1]               0
AdaptiveAvgPool2d-13            [-1, 64, 1, 56]               0
           Conv2d-14            [-1, 8, 112, 1]             520
      BatchNorm2d-15            [-1, 8, 112, 1]              16
            ReLU6-16            [-1, 8, 112, 1]               0
        h_sigmoid-17            [-1, 8, 112, 1]               0
          h_swish-18            [-1, 8, 112, 1]               0
           Conv2d-19            [-1, 64, 56, 1]             576
           Conv2d-20            [-1, 64, 1, 56]             576
         CoordAtt-21           [-1, 64, 56, 56]               0
             ReLU-22           [-1, 64, 56, 56]               0
            CARes-23           [-1, 64, 56, 56]               0
           Conv2d-24           [-1, 64, 56, 56]          36,928
      BatchNorm2d-25           [-1, 64, 56, 56]             128
             ReLU-26           [-1, 64, 56, 56]               0
           Conv2d-27           [-1, 64, 56, 56]          36,928
      BatchNorm2d-28           [-1, 64, 56, 56]             128
AdaptiveAvgPool2d-29            [-1, 64, 56, 1]               0
AdaptiveAvgPool2d-30            [-1, 64, 1, 56]               0
           Conv2d-31            [-1, 8, 112, 1]             520
      BatchNorm2d-32            [-1, 8, 112, 1]              16
            ReLU6-33            [-1, 8, 112, 1]               0
        h_sigmoid-34            [-1, 8, 112, 1]               0
          h_swish-35            [-1, 8, 112, 1]               0
           Conv2d-36            [-1, 64, 56, 1]             576
           Conv2d-37            [-1, 64, 1, 56]             576
         CoordAtt-38           [-1, 64, 56, 56]               0
             ReLU-39           [-1, 64, 56, 56]               0
            CARes-40           [-1, 64, 56, 56]               0
           Conv2d-41           [-1, 64, 56, 56]          36,928
      BatchNorm2d-42           [-1, 64, 56, 56]             128
             ReLU-43           [-1, 64, 56, 56]               0
           Conv2d-44           [-1, 64, 56, 56]          36,928
      BatchNorm2d-45           [-1, 64, 56, 56]             128
AdaptiveAvgPool2d-46            [-1, 64, 56, 1]               0
AdaptiveAvgPool2d-47            [-1, 64, 1, 56]               0
           Conv2d-48            [-1, 8, 112, 1]             520
      BatchNorm2d-49            [-1, 8, 112, 1]              16
            ReLU6-50            [-1, 8, 112, 1]               0
        h_sigmoid-51            [-1, 8, 112, 1]               0
          h_swish-52            [-1, 8, 112, 1]               0
           Conv2d-53            [-1, 64, 56, 1]             576
           Conv2d-54            [-1, 64, 1, 56]             576
         CoordAtt-55           [-1, 64, 56, 56]               0
             ReLU-56           [-1, 64, 56, 56]               0
            CARes-57           [-1, 64, 56, 56]               0
           Conv2d-58           [-1, 64, 56, 56]          36,928
      BatchNorm2d-59           [-1, 64, 56, 56]             128
             ReLU-60           [-1, 64, 56, 56]               0
           Conv2d-61           [-1, 64, 56, 56]          36,928
      BatchNorm2d-62           [-1, 64, 56, 56]             128
AdaptiveAvgPool2d-63            [-1, 64, 56, 1]               0
AdaptiveAvgPool2d-64            [-1, 64, 1, 56]               0
           Conv2d-65            [-1, 8, 112, 1]             520
      BatchNorm2d-66            [-1, 8, 112, 1]              16
            ReLU6-67            [-1, 8, 112, 1]               0
        h_sigmoid-68            [-1, 8, 112, 1]               0
          h_swish-69            [-1, 8, 112, 1]               0
           Conv2d-70            [-1, 64, 56, 1]             576
           Conv2d-71            [-1, 64, 1, 56]             576
         CoordAtt-72           [-1, 64, 56, 56]               0
             ReLU-73           [-1, 64, 56, 56]               0
            CARes-74           [-1, 64, 56, 56]               0
           Conv2d-75           [-1, 64, 56, 56]          36,928
      BatchNorm2d-76           [-1, 64, 56, 56]             128
             ReLU-77           [-1, 64, 56, 56]               0
           Conv2d-78           [-1, 64, 56, 56]          36,928
      BatchNorm2d-79           [-1, 64, 56, 56]             128
AdaptiveAvgPool2d-80            [-1, 64, 56, 1]               0
AdaptiveAvgPool2d-81            [-1, 64, 1, 56]               0
           Conv2d-82            [-1, 8, 112, 1]             520
      BatchNorm2d-83            [-1, 8, 112, 1]              16
            ReLU6-84            [-1, 8, 112, 1]               0
        h_sigmoid-85            [-1, 8, 112, 1]               0
          h_swish-86            [-1, 8, 112, 1]               0
           Conv2d-87            [-1, 64, 56, 1]             576
           Conv2d-88            [-1, 64, 1, 56]             576
         CoordAtt-89           [-1, 64, 56, 56]               0
             ReLU-90           [-1, 64, 56, 56]               0
            CARes-91           [-1, 64, 56, 56]               0
  ConvTranspose2d-92         [-1, 32, 113, 113]          32,800
      BatchNorm2d-93         [-1, 32, 113, 113]              64
  ConvTranspose2d-94         [-1, 16, 225, 225]           8,208
      BatchNorm2d-95         [-1, 16, 225, 225]              32
  ConvTranspose2d-96         [-1, 16, 225, 225]          20,752
          Dropout-97         [-1, 16, 225, 225]               0
           Conv2d-98          [-1, 1, 224, 224]              65
          Dropout-99         [-1, 16, 225, 225]               0
          Conv2d-100          [-1, 1, 224, 224]              65
         Dropout-101         [-1, 16, 225, 225]               0
          Conv2d-102          [-1, 1, 224, 224]              65
         Dropout-103         [-1, 16, 225, 225]               0
          Conv2d-104          [-1, 1, 224, 224]              65
================================================================
Total params: 487,596
Trainable params: 379,580
Non-trainable params: 108,016
----------------------------------------------------------------
Input size (MB): 0.77
Forward/backward pass size (MB): 134.43
Params size (MB): 1.86
Estimated Total Size (MB): 137.06
----------------------------------------------------------------
