----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 16, 224, 224]           5,200
       BatchNorm2d-2         [-1, 16, 224, 224]              32
              ReLU-3         [-1, 16, 224, 224]               0
              Conv-4         [-1, 16, 224, 224]               0
            Conv2d-5         [-1, 32, 112, 112]           4,640
       BatchNorm2d-6         [-1, 32, 112, 112]              64
              ReLU-7         [-1, 32, 112, 112]               0
              Conv-8         [-1, 32, 112, 112]               0
            Conv2d-9           [-1, 64, 56, 56]          18,496
      BatchNorm2d-10           [-1, 64, 56, 56]             128
             ReLU-11           [-1, 64, 56, 56]               0
             Conv-12           [-1, 64, 56, 56]               0
           Conv2d-13           [-1, 64, 28, 28]          36,928
      BatchNorm2d-14           [-1, 64, 28, 28]             128
             ReLU-15           [-1, 64, 28, 28]               0
             Conv-16           [-1, 64, 28, 28]               0
           Conv2d-17           [-1, 64, 28, 28]          36,928
      BatchNorm2d-18           [-1, 64, 28, 28]             128
             ReLU-19           [-1, 64, 28, 28]               0
           Conv2d-20           [-1, 64, 28, 28]          36,928
      BatchNorm2d-21           [-1, 64, 28, 28]             128
AdaptiveAvgPool2d-22            [-1, 64, 28, 1]               0
AdaptiveAvgPool2d-23            [-1, 64, 1, 28]               0
           Conv2d-24             [-1, 8, 56, 1]             520
      BatchNorm2d-25             [-1, 8, 56, 1]              16
            ReLU6-26             [-1, 8, 56, 1]               0
        h_sigmoid-27             [-1, 8, 56, 1]               0
          h_swish-28             [-1, 8, 56, 1]               0
           Conv2d-29            [-1, 64, 28, 1]             576
           Conv2d-30            [-1, 64, 1, 28]             576
         CoordAtt-31           [-1, 64, 28, 28]               0
             ReLU-32           [-1, 64, 28, 28]               0
            CARes-33           [-1, 64, 28, 28]               0
           Conv2d-34           [-1, 64, 28, 28]          36,928
      BatchNorm2d-35           [-1, 64, 28, 28]             128
             ReLU-36           [-1, 64, 28, 28]               0
           Conv2d-37           [-1, 64, 28, 28]          36,928
      BatchNorm2d-38           [-1, 64, 28, 28]             128
AdaptiveAvgPool2d-39            [-1, 64, 28, 1]               0
AdaptiveAvgPool2d-40            [-1, 64, 1, 28]               0
           Conv2d-41             [-1, 8, 56, 1]             520
      BatchNorm2d-42             [-1, 8, 56, 1]              16
            ReLU6-43             [-1, 8, 56, 1]               0
        h_sigmoid-44             [-1, 8, 56, 1]               0
          h_swish-45             [-1, 8, 56, 1]               0
           Conv2d-46            [-1, 64, 28, 1]             576
           Conv2d-47            [-1, 64, 1, 28]             576
         CoordAtt-48           [-1, 64, 28, 28]               0
             ReLU-49           [-1, 64, 28, 28]               0
            CARes-50           [-1, 64, 28, 28]               0
           Conv2d-51           [-1, 64, 28, 28]          36,928
      BatchNorm2d-52           [-1, 64, 28, 28]             128
             ReLU-53           [-1, 64, 28, 28]               0
           Conv2d-54           [-1, 64, 28, 28]          36,928
      BatchNorm2d-55           [-1, 64, 28, 28]             128
AdaptiveAvgPool2d-56            [-1, 64, 28, 1]               0
AdaptiveAvgPool2d-57            [-1, 64, 1, 28]               0
           Conv2d-58             [-1, 8, 56, 1]             520
      BatchNorm2d-59             [-1, 8, 56, 1]              16
            ReLU6-60             [-1, 8, 56, 1]               0
        h_sigmoid-61             [-1, 8, 56, 1]               0
          h_swish-62             [-1, 8, 56, 1]               0
           Conv2d-63            [-1, 64, 28, 1]             576
           Conv2d-64            [-1, 64, 1, 28]             576
         CoordAtt-65           [-1, 64, 28, 28]               0
             ReLU-66           [-1, 64, 28, 28]               0
            CARes-67           [-1, 64, 28, 28]               0
           Conv2d-68           [-1, 64, 28, 28]          36,928
      BatchNorm2d-69           [-1, 64, 28, 28]             128
             ReLU-70           [-1, 64, 28, 28]               0
           Conv2d-71           [-1, 64, 28, 28]          36,928
      BatchNorm2d-72           [-1, 64, 28, 28]             128
AdaptiveAvgPool2d-73            [-1, 64, 28, 1]               0
AdaptiveAvgPool2d-74            [-1, 64, 1, 28]               0
           Conv2d-75             [-1, 8, 56, 1]             520
      BatchNorm2d-76             [-1, 8, 56, 1]              16
            ReLU6-77             [-1, 8, 56, 1]               0
        h_sigmoid-78             [-1, 8, 56, 1]               0
          h_swish-79             [-1, 8, 56, 1]               0
           Conv2d-80            [-1, 64, 28, 1]             576
           Conv2d-81            [-1, 64, 1, 28]             576
         CoordAtt-82           [-1, 64, 28, 28]               0
             ReLU-83           [-1, 64, 28, 28]               0
            CARes-84           [-1, 64, 28, 28]               0
           Conv2d-85           [-1, 64, 28, 28]          36,928
      BatchNorm2d-86           [-1, 64, 28, 28]             128
             ReLU-87           [-1, 64, 28, 28]               0
           Conv2d-88           [-1, 64, 28, 28]          36,928
      BatchNorm2d-89           [-1, 64, 28, 28]             128
AdaptiveAvgPool2d-90            [-1, 64, 28, 1]               0
AdaptiveAvgPool2d-91            [-1, 64, 1, 28]               0
           Conv2d-92             [-1, 8, 56, 1]             520
      BatchNorm2d-93             [-1, 8, 56, 1]              16
            ReLU6-94             [-1, 8, 56, 1]               0
        h_sigmoid-95             [-1, 8, 56, 1]               0
          h_swish-96             [-1, 8, 56, 1]               0
           Conv2d-97            [-1, 64, 28, 1]             576
           Conv2d-98            [-1, 64, 1, 28]             576
         CoordAtt-99           [-1, 64, 28, 28]               0
            ReLU-100           [-1, 64, 28, 28]               0
           CARes-101           [-1, 64, 28, 28]               0
 ConvTranspose2d-102           [-1, 32, 56, 56]          32,800
     BatchNorm2d-103           [-1, 32, 56, 56]              64
           Trans-104           [-1, 32, 56, 56]               0
 ConvTranspose2d-105         [-1, 16, 112, 112]           8,208
     BatchNorm2d-106         [-1, 16, 112, 112]              32
           Trans-107         [-1, 16, 112, 112]               0
 ConvTranspose2d-108         [-1, 16, 225, 225]           4,112
     BatchNorm2d-109         [-1, 16, 225, 225]              32
           Trans-110         [-1, 16, 225, 225]               0
 ConvTranspose2d-111         [-1, 16, 225, 225]          20,752
           Trans-112         [-1, 16, 225, 225]               0
         Dropout-113         [-1, 16, 225, 225]               0
          Conv2d-114          [-1, 1, 224, 224]              65
         Dropout-115         [-1, 16, 225, 225]               0
          Conv2d-116          [-1, 1, 224, 224]              65
         Dropout-117         [-1, 16, 225, 225]               0
          Conv2d-118          [-1, 1, 224, 224]              65
         Dropout-119         [-1, 16, 225, 225]               0
          Conv2d-120          [-1, 1, 224, 224]              65
================================================================
Total params: 510,876
Trainable params: 510,876
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.77
Forward/backward pass size (MB): 124.12
Params size (MB): 1.95
Estimated Total Size (MB): 126.83
----------------------------------------------------------------
