----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 16, 224, 224]           5,200
       BatchNorm2d-2         [-1, 16, 224, 224]              32
              ReLU-3         [-1, 16, 224, 224]               0
              Conv-4         [-1, 16, 224, 224]               0
            Conv2d-5         [-1, 32, 112, 112]           4,640
       BatchNorm2d-6         [-1, 32, 112, 112]              64
              ReLU-7         [-1, 32, 112, 112]               0
              Conv-8         [-1, 32, 112, 112]               0
            Conv2d-9           [-1, 64, 56, 56]          18,496
      BatchNorm2d-10           [-1, 64, 56, 56]             128
             ReLU-11           [-1, 64, 56, 56]               0
             Conv-12           [-1, 64, 56, 56]               0
           Conv2d-13           [-1, 32, 56, 56]           2,080
      BatchNorm2d-14           [-1, 32, 56, 56]              64
             ReLU-15           [-1, 32, 56, 56]               0
             Conv-16           [-1, 32, 56, 56]               0
           Conv2d-17           [-1, 32, 56, 56]           1,056
      BatchNorm2d-18           [-1, 32, 56, 56]              64
             ReLU-19           [-1, 32, 56, 56]               0
             Conv-20           [-1, 32, 56, 56]               0
           Conv2d-21           [-1, 32, 28, 28]           9,248
      BatchNorm2d-22           [-1, 32, 28, 28]              64
             ReLU-23           [-1, 32, 28, 28]               0
             Conv-24           [-1, 32, 28, 28]               0
       Bottleneck-25           [-1, 32, 28, 28]               0
           Conv2d-26           [-1, 32, 28, 28]          18,464
      BatchNorm2d-27           [-1, 32, 28, 28]              64
             ReLU-28           [-1, 32, 28, 28]               0
             Conv-29           [-1, 32, 28, 28]               0
           Conv2d-30           [-1, 64, 28, 28]           4,160
      BatchNorm2d-31           [-1, 64, 28, 28]             128
             ReLU-32           [-1, 64, 28, 28]               0
             Conv-33           [-1, 64, 28, 28]               0
AdaptiveAvgPool2d-34            [-1, 64, 28, 1]               0
AdaptiveAvgPool2d-35            [-1, 64, 1, 28]               0
           Conv2d-36             [-1, 8, 56, 1]             520
      BatchNorm2d-37             [-1, 8, 56, 1]              16
            ReLU6-38             [-1, 8, 56, 1]               0
        h_sigmoid-39             [-1, 8, 56, 1]               0
          h_swish-40             [-1, 8, 56, 1]               0
           Conv2d-41            [-1, 64, 28, 1]             576
           Conv2d-42            [-1, 64, 1, 28]             576
         CoordAtt-43           [-1, 64, 28, 28]               0
            C3_CA-44           [-1, 64, 28, 28]               0
           Conv2d-45           [-1, 32, 28, 28]           2,080
      BatchNorm2d-46           [-1, 32, 28, 28]              64
             ReLU-47           [-1, 32, 28, 28]               0
             Conv-48           [-1, 32, 28, 28]               0
           Conv2d-49           [-1, 32, 28, 28]           1,056
      BatchNorm2d-50           [-1, 32, 28, 28]              64
             ReLU-51           [-1, 32, 28, 28]               0
             Conv-52           [-1, 32, 28, 28]               0
           Conv2d-53           [-1, 32, 28, 28]           9,248
      BatchNorm2d-54           [-1, 32, 28, 28]              64
             ReLU-55           [-1, 32, 28, 28]               0
             Conv-56           [-1, 32, 28, 28]               0
       Bottleneck-57           [-1, 32, 28, 28]               0
           Conv2d-58           [-1, 32, 28, 28]          18,464
      BatchNorm2d-59           [-1, 32, 28, 28]              64
             ReLU-60           [-1, 32, 28, 28]               0
             Conv-61           [-1, 32, 28, 28]               0
           Conv2d-62           [-1, 64, 28, 28]           4,160
      BatchNorm2d-63           [-1, 64, 28, 28]             128
             ReLU-64           [-1, 64, 28, 28]               0
             Conv-65           [-1, 64, 28, 28]               0
AdaptiveAvgPool2d-66            [-1, 64, 28, 1]               0
AdaptiveAvgPool2d-67            [-1, 64, 1, 28]               0
           Conv2d-68             [-1, 8, 56, 1]             520
      BatchNorm2d-69             [-1, 8, 56, 1]              16
            ReLU6-70             [-1, 8, 56, 1]               0
        h_sigmoid-71             [-1, 8, 56, 1]               0
          h_swish-72             [-1, 8, 56, 1]               0
           Conv2d-73            [-1, 64, 28, 1]             576
           Conv2d-74            [-1, 64, 1, 28]             576
         CoordAtt-75           [-1, 64, 28, 28]               0
            C3_CA-76           [-1, 64, 28, 28]               0
           Conv2d-77           [-1, 32, 28, 28]           2,080
      BatchNorm2d-78           [-1, 32, 28, 28]              64
             ReLU-79           [-1, 32, 28, 28]               0
             Conv-80           [-1, 32, 28, 28]               0
           Conv2d-81           [-1, 32, 28, 28]           1,056
      BatchNorm2d-82           [-1, 32, 28, 28]              64
             ReLU-83           [-1, 32, 28, 28]               0
             Conv-84           [-1, 32, 28, 28]               0
           Conv2d-85           [-1, 32, 28, 28]           9,248
      BatchNorm2d-86           [-1, 32, 28, 28]              64
             ReLU-87           [-1, 32, 28, 28]               0
             Conv-88           [-1, 32, 28, 28]               0
       Bottleneck-89           [-1, 32, 28, 28]               0
           Conv2d-90           [-1, 32, 28, 28]          18,464
      BatchNorm2d-91           [-1, 32, 28, 28]              64
             ReLU-92           [-1, 32, 28, 28]               0
             Conv-93           [-1, 32, 28, 28]               0
           Conv2d-94           [-1, 64, 28, 28]           4,160
      BatchNorm2d-95           [-1, 64, 28, 28]             128
             ReLU-96           [-1, 64, 28, 28]               0
             Conv-97           [-1, 64, 28, 28]               0
AdaptiveAvgPool2d-98            [-1, 64, 28, 1]               0
AdaptiveAvgPool2d-99            [-1, 64, 1, 28]               0
          Conv2d-100             [-1, 8, 56, 1]             520
     BatchNorm2d-101             [-1, 8, 56, 1]              16
           ReLU6-102             [-1, 8, 56, 1]               0
       h_sigmoid-103             [-1, 8, 56, 1]               0
         h_swish-104             [-1, 8, 56, 1]               0
          Conv2d-105            [-1, 64, 28, 1]             576
          Conv2d-106            [-1, 64, 1, 28]             576
        CoordAtt-107           [-1, 64, 28, 28]               0
           C3_CA-108           [-1, 64, 28, 28]               0
          Conv2d-109           [-1, 32, 28, 28]           2,080
     BatchNorm2d-110           [-1, 32, 28, 28]              64
            ReLU-111           [-1, 32, 28, 28]               0
            Conv-112           [-1, 32, 28, 28]               0
          Conv2d-113           [-1, 32, 28, 28]           1,056
     BatchNorm2d-114           [-1, 32, 28, 28]              64
            ReLU-115           [-1, 32, 28, 28]               0
            Conv-116           [-1, 32, 28, 28]               0
          Conv2d-117           [-1, 32, 28, 28]           9,248
     BatchNorm2d-118           [-1, 32, 28, 28]              64
            ReLU-119           [-1, 32, 28, 28]               0
            Conv-120           [-1, 32, 28, 28]               0
      Bottleneck-121           [-1, 32, 28, 28]               0
          Conv2d-122           [-1, 32, 28, 28]          18,464
     BatchNorm2d-123           [-1, 32, 28, 28]              64
            ReLU-124           [-1, 32, 28, 28]               0
            Conv-125           [-1, 32, 28, 28]               0
          Conv2d-126           [-1, 64, 28, 28]           4,160
     BatchNorm2d-127           [-1, 64, 28, 28]             128
            ReLU-128           [-1, 64, 28, 28]               0
            Conv-129           [-1, 64, 28, 28]               0
AdaptiveAvgPool2d-130            [-1, 64, 28, 1]               0
AdaptiveAvgPool2d-131            [-1, 64, 1, 28]               0
          Conv2d-132             [-1, 8, 56, 1]             520
     BatchNorm2d-133             [-1, 8, 56, 1]              16
           ReLU6-134             [-1, 8, 56, 1]               0
       h_sigmoid-135             [-1, 8, 56, 1]               0
         h_swish-136             [-1, 8, 56, 1]               0
          Conv2d-137            [-1, 64, 28, 1]             576
          Conv2d-138            [-1, 64, 1, 28]             576
        CoordAtt-139           [-1, 64, 28, 28]               0
           C3_CA-140           [-1, 64, 28, 28]               0
          Conv2d-141           [-1, 32, 28, 28]           2,080
     BatchNorm2d-142           [-1, 32, 28, 28]              64
            ReLU-143           [-1, 32, 28, 28]               0
            Conv-144           [-1, 32, 28, 28]               0
          Conv2d-145           [-1, 32, 28, 28]           1,056
     BatchNorm2d-146           [-1, 32, 28, 28]              64
            ReLU-147           [-1, 32, 28, 28]               0
            Conv-148           [-1, 32, 28, 28]               0
          Conv2d-149           [-1, 32, 28, 28]           1,056
     BatchNorm2d-150           [-1, 32, 28, 28]              64
            ReLU-151           [-1, 32, 28, 28]               0
            Conv-152           [-1, 32, 28, 28]               0
      Bottleneck-153           [-1, 32, 28, 28]               0
          Conv2d-154           [-1, 32, 28, 28]           2,080
     BatchNorm2d-155           [-1, 32, 28, 28]              64
            ReLU-156           [-1, 32, 28, 28]               0
            Conv-157           [-1, 32, 28, 28]               0
          Conv2d-158           [-1, 64, 28, 28]           4,160
     BatchNorm2d-159           [-1, 64, 28, 28]             128
            ReLU-160           [-1, 64, 28, 28]               0
            Conv-161           [-1, 64, 28, 28]               0
AdaptiveAvgPool2d-162            [-1, 64, 28, 1]               0
AdaptiveAvgPool2d-163            [-1, 64, 1, 28]               0
          Conv2d-164             [-1, 8, 56, 1]             520
     BatchNorm2d-165             [-1, 8, 56, 1]              16
           ReLU6-166             [-1, 8, 56, 1]               0
       h_sigmoid-167             [-1, 8, 56, 1]               0
         h_swish-168             [-1, 8, 56, 1]               0
          Conv2d-169            [-1, 64, 28, 1]             576
          Conv2d-170            [-1, 64, 1, 28]             576
        CoordAtt-171           [-1, 64, 28, 28]               0
           C3_CA-172           [-1, 64, 28, 28]               0
 ConvTranspose2d-173           [-1, 32, 56, 56]          32,800
     BatchNorm2d-174           [-1, 32, 56, 56]              64
           Trans-175           [-1, 32, 56, 56]               0
 ConvTranspose2d-176         [-1, 16, 112, 112]           8,208
     BatchNorm2d-177         [-1, 16, 112, 112]              32
           Trans-178         [-1, 16, 112, 112]               0
 ConvTranspose2d-179         [-1, 16, 225, 225]           4,112
     BatchNorm2d-180         [-1, 16, 225, 225]              32
           Trans-181         [-1, 16, 225, 225]               0
 ConvTranspose2d-182         [-1, 16, 225, 225]          20,752
           Trans-183         [-1, 16, 225, 225]               0
         Dropout-184         [-1, 16, 225, 225]               0
          Conv2d-185          [-1, 1, 224, 224]              65
         Dropout-186         [-1, 16, 225, 225]               0
          Conv2d-187          [-1, 1, 224, 224]              65
         Dropout-188         [-1, 16, 225, 225]               0
          Conv2d-189          [-1, 1, 224, 224]              65
         Dropout-190         [-1, 16, 225, 225]               0
          Conv2d-191          [-1, 1, 224, 224]              65
================================================================
Total params: 255,644
Trainable params: 255,644
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.77
Forward/backward pass size (MB): 139.62
Params size (MB): 0.98
Estimated Total Size (MB): 141.36
----------------------------------------------------------------
