----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 16, 224, 224]           5,200
       BatchNorm2d-2         [-1, 16, 224, 224]              32
              ReLU-3         [-1, 16, 224, 224]               0
              Conv-4         [-1, 16, 224, 224]               0
            Conv2d-5         [-1, 32, 112, 112]           4,640
       BatchNorm2d-6         [-1, 32, 112, 112]              64
              ReLU-7         [-1, 32, 112, 112]               0
              Conv-8         [-1, 32, 112, 112]               0
            Conv2d-9           [-1, 64, 56, 56]          18,496
      BatchNorm2d-10           [-1, 64, 56, 56]             128
             ReLU-11           [-1, 64, 56, 56]               0
             Conv-12           [-1, 64, 56, 56]               0
           Conv2d-13           [-1, 64, 28, 28]          36,928
      BatchNorm2d-14           [-1, 64, 28, 28]             128
             ReLU-15           [-1, 64, 28, 28]               0
             Conv-16           [-1, 64, 28, 28]               0
           Conv2d-17           [-1, 64, 28, 28]          36,928
      BatchNorm2d-18           [-1, 64, 28, 28]             128
           Conv2d-19           [-1, 64, 28, 28]          36,928
      BatchNorm2d-20           [-1, 64, 28, 28]             128
    ResidualBlock-21           [-1, 64, 28, 28]               0
           Conv2d-22           [-1, 64, 28, 28]          36,928
      BatchNorm2d-23           [-1, 64, 28, 28]             128
           Conv2d-24           [-1, 64, 28, 28]          36,928
      BatchNorm2d-25           [-1, 64, 28, 28]             128
    ResidualBlock-26           [-1, 64, 28, 28]               0
           Conv2d-27           [-1, 64, 28, 28]          36,928
      BatchNorm2d-28           [-1, 64, 28, 28]             128
           Conv2d-29           [-1, 64, 28, 28]          36,928
      BatchNorm2d-30           [-1, 64, 28, 28]             128
    ResidualBlock-31           [-1, 64, 28, 28]               0
           Conv2d-32           [-1, 64, 28, 28]          36,928
      BatchNorm2d-33           [-1, 64, 28, 28]             128
           Conv2d-34           [-1, 64, 28, 28]          36,928
      BatchNorm2d-35           [-1, 64, 28, 28]             128
    ResidualBlock-36           [-1, 64, 28, 28]               0
           Conv2d-37           [-1, 64, 28, 28]          36,928
      BatchNorm2d-38           [-1, 64, 28, 28]             128
           Conv2d-39           [-1, 64, 28, 28]          36,928
      BatchNorm2d-40           [-1, 64, 28, 28]             128
    ResidualBlock-41           [-1, 64, 28, 28]               0
  ConvTranspose2d-42           [-1, 32, 56, 56]          32,800
      BatchNorm2d-43           [-1, 32, 56, 56]              64
            Trans-44           [-1, 32, 56, 56]               0
  ConvTranspose2d-45         [-1, 16, 112, 112]           8,208
      BatchNorm2d-46         [-1, 16, 112, 112]              32
            Trans-47         [-1, 16, 112, 112]               0
  ConvTranspose2d-48         [-1, 16, 225, 225]           4,112
      BatchNorm2d-49         [-1, 16, 225, 225]              32
            Trans-50         [-1, 16, 225, 225]               0
  ConvTranspose2d-51         [-1, 16, 225, 225]          20,752
            Trans-52         [-1, 16, 225, 225]               0
          Dropout-53         [-1, 16, 225, 225]               0
           Conv2d-54          [-1, 1, 224, 224]              65
          Dropout-55         [-1, 16, 225, 225]               0
           Conv2d-56          [-1, 1, 224, 224]              65
          Dropout-57         [-1, 16, 225, 225]               0
           Conv2d-58          [-1, 1, 224, 224]              65
          Dropout-59         [-1, 16, 225, 225]               0
           Conv2d-60          [-1, 1, 224, 224]              65
================================================================
Total params: 502,436
Trainable params: 436,820
Non-trainable params: 65,616
----------------------------------------------------------------
Input size (MB): 0.77
Forward/backward pass size (MB): 118.02
Params size (MB): 1.92
Estimated Total Size (MB): 120.70
----------------------------------------------------------------
