----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 16, 224, 224]           3,904
       BatchNorm2d-2         [-1, 16, 224, 224]              32
            Conv2d-3         [-1, 16, 224, 224]             272
       BatchNorm2d-4         [-1, 16, 224, 224]              32
              SiLU-5         [-1, 16, 224, 224]               0
              Conv-6         [-1, 16, 224, 224]               0
            Conv2d-7         [-1, 16, 224, 224]             272
       BatchNorm2d-8         [-1, 16, 224, 224]              32
              SiLU-9         [-1, 16, 224, 224]               0
             Conv-10         [-1, 16, 224, 224]               0
           Conv2d-11         [-1, 16, 112, 112]           2,320
      BatchNorm2d-12         [-1, 16, 112, 112]              32
             SiLU-13         [-1, 16, 112, 112]               0
             Conv-14         [-1, 16, 112, 112]               0
       Bottleneck-15         [-1, 16, 112, 112]               0
           Conv2d-16         [-1, 16, 112, 112]           2,320
      BatchNorm2d-17         [-1, 16, 112, 112]              32
             SiLU-18         [-1, 16, 112, 112]               0
             Conv-19         [-1, 16, 112, 112]               0
           Conv2d-20         [-1, 32, 112, 112]           1,056
      BatchNorm2d-21         [-1, 32, 112, 112]              64
             SiLU-22         [-1, 32, 112, 112]               0
             Conv-23         [-1, 32, 112, 112]               0
               C3-24         [-1, 32, 112, 112]               0
           Conv2d-25         [-1, 32, 112, 112]           1,056
      BatchNorm2d-26         [-1, 32, 112, 112]              64
             SiLU-27         [-1, 32, 112, 112]               0
             Conv-28         [-1, 32, 112, 112]               0
           Conv2d-29         [-1, 32, 112, 112]           1,056
      BatchNorm2d-30         [-1, 32, 112, 112]              64
             SiLU-31         [-1, 32, 112, 112]               0
             Conv-32         [-1, 32, 112, 112]               0
           Conv2d-33           [-1, 32, 56, 56]           9,248
      BatchNorm2d-34           [-1, 32, 56, 56]              64
             SiLU-35           [-1, 32, 56, 56]               0
             Conv-36           [-1, 32, 56, 56]               0
       Bottleneck-37           [-1, 32, 56, 56]               0
           Conv2d-38           [-1, 32, 56, 56]           9,248
      BatchNorm2d-39           [-1, 32, 56, 56]              64
             SiLU-40           [-1, 32, 56, 56]               0
             Conv-41           [-1, 32, 56, 56]               0
           Conv2d-42           [-1, 64, 56, 56]           4,160
      BatchNorm2d-43           [-1, 64, 56, 56]             128
             SiLU-44           [-1, 64, 56, 56]               0
             Conv-45           [-1, 64, 56, 56]               0
               C3-46           [-1, 64, 56, 56]               0
           Conv2d-47           [-1, 32, 56, 56]           2,080
      BatchNorm2d-48           [-1, 32, 56, 56]              64
             SiLU-49           [-1, 32, 56, 56]               0
             Conv-50           [-1, 32, 56, 56]               0
           Conv2d-51           [-1, 32, 56, 56]           1,056
      BatchNorm2d-52           [-1, 32, 56, 56]              64
             SiLU-53           [-1, 32, 56, 56]               0
             Conv-54           [-1, 32, 56, 56]               0
           Conv2d-55           [-1, 32, 56, 56]           1,056
      BatchNorm2d-56           [-1, 32, 56, 56]              64
             SiLU-57           [-1, 32, 56, 56]               0
             Conv-58           [-1, 32, 56, 56]               0
       Bottleneck-59           [-1, 32, 56, 56]               0
           Conv2d-60           [-1, 32, 56, 56]           1,056
      BatchNorm2d-61           [-1, 32, 56, 56]              64
             SiLU-62           [-1, 32, 56, 56]               0
             Conv-63           [-1, 32, 56, 56]               0
           Conv2d-64           [-1, 32, 56, 56]           1,056
      BatchNorm2d-65           [-1, 32, 56, 56]              64
             SiLU-66           [-1, 32, 56, 56]               0
             Conv-67           [-1, 32, 56, 56]               0
       Bottleneck-68           [-1, 32, 56, 56]               0
           Conv2d-69           [-1, 32, 56, 56]           1,056
      BatchNorm2d-70           [-1, 32, 56, 56]              64
             SiLU-71           [-1, 32, 56, 56]               0
             Conv-72           [-1, 32, 56, 56]               0
           Conv2d-73           [-1, 32, 56, 56]           1,056
      BatchNorm2d-74           [-1, 32, 56, 56]              64
             SiLU-75           [-1, 32, 56, 56]               0
             Conv-76           [-1, 32, 56, 56]               0
       Bottleneck-77           [-1, 32, 56, 56]               0
           Conv2d-78           [-1, 32, 56, 56]           2,080
      BatchNorm2d-79           [-1, 32, 56, 56]              64
             SiLU-80           [-1, 32, 56, 56]               0
             Conv-81           [-1, 32, 56, 56]               0
           Conv2d-82           [-1, 64, 56, 56]           4,160
      BatchNorm2d-83           [-1, 64, 56, 56]             128
             SiLU-84           [-1, 64, 56, 56]               0
             Conv-85           [-1, 64, 56, 56]               0
               C3-86           [-1, 64, 56, 56]               0
           Conv2d-87           [-1, 64, 56, 56]          36,928
      BatchNorm2d-88           [-1, 64, 56, 56]             128
             ReLU-89           [-1, 64, 56, 56]               0
           Conv2d-90           [-1, 64, 56, 56]          36,928
      BatchNorm2d-91           [-1, 64, 56, 56]             128
AdaptiveAvgPool2d-92            [-1, 64, 56, 1]               0
AdaptiveAvgPool2d-93            [-1, 64, 1, 56]               0
           Conv2d-94            [-1, 8, 112, 1]             520
      BatchNorm2d-95            [-1, 8, 112, 1]              16
            ReLU6-96            [-1, 8, 112, 1]               0
        h_sigmoid-97            [-1, 8, 112, 1]               0
          h_swish-98            [-1, 8, 112, 1]               0
           Conv2d-99            [-1, 64, 56, 1]             576
          Conv2d-100            [-1, 64, 1, 56]             576
        CoordAtt-101           [-1, 64, 56, 56]               0
            ReLU-102           [-1, 64, 56, 56]               0
           CARes-103           [-1, 64, 56, 56]               0
          Conv2d-104           [-1, 64, 56, 56]          36,928
     BatchNorm2d-105           [-1, 64, 56, 56]             128
            ReLU-106           [-1, 64, 56, 56]               0
          Conv2d-107           [-1, 64, 56, 56]          36,928
     BatchNorm2d-108           [-1, 64, 56, 56]             128
AdaptiveAvgPool2d-109            [-1, 64, 56, 1]               0
AdaptiveAvgPool2d-110            [-1, 64, 1, 56]               0
          Conv2d-111            [-1, 8, 112, 1]             520
     BatchNorm2d-112            [-1, 8, 112, 1]              16
           ReLU6-113            [-1, 8, 112, 1]               0
       h_sigmoid-114            [-1, 8, 112, 1]               0
         h_swish-115            [-1, 8, 112, 1]               0
          Conv2d-116            [-1, 64, 56, 1]             576
          Conv2d-117            [-1, 64, 1, 56]             576
        CoordAtt-118           [-1, 64, 56, 56]               0
            ReLU-119           [-1, 64, 56, 56]               0
           CARes-120           [-1, 64, 56, 56]               0
          Conv2d-121           [-1, 64, 56, 56]          36,928
     BatchNorm2d-122           [-1, 64, 56, 56]             128
            ReLU-123           [-1, 64, 56, 56]               0
          Conv2d-124           [-1, 64, 56, 56]          36,928
     BatchNorm2d-125           [-1, 64, 56, 56]             128
AdaptiveAvgPool2d-126            [-1, 64, 56, 1]               0
AdaptiveAvgPool2d-127            [-1, 64, 1, 56]               0
          Conv2d-128            [-1, 8, 112, 1]             520
     BatchNorm2d-129            [-1, 8, 112, 1]              16
           ReLU6-130            [-1, 8, 112, 1]               0
       h_sigmoid-131            [-1, 8, 112, 1]               0
         h_swish-132            [-1, 8, 112, 1]               0
          Conv2d-133            [-1, 64, 56, 1]             576
          Conv2d-134            [-1, 64, 1, 56]             576
        CoordAtt-135           [-1, 64, 56, 56]               0
            ReLU-136           [-1, 64, 56, 56]               0
           CARes-137           [-1, 64, 56, 56]               0
          Conv2d-138           [-1, 64, 56, 56]          36,928
     BatchNorm2d-139           [-1, 64, 56, 56]             128
            ReLU-140           [-1, 64, 56, 56]               0
          Conv2d-141           [-1, 64, 56, 56]          36,928
     BatchNorm2d-142           [-1, 64, 56, 56]             128
AdaptiveAvgPool2d-143            [-1, 64, 56, 1]               0
AdaptiveAvgPool2d-144            [-1, 64, 1, 56]               0
          Conv2d-145            [-1, 8, 112, 1]             520
     BatchNorm2d-146            [-1, 8, 112, 1]              16
           ReLU6-147            [-1, 8, 112, 1]               0
       h_sigmoid-148            [-1, 8, 112, 1]               0
         h_swish-149            [-1, 8, 112, 1]               0
          Conv2d-150            [-1, 64, 56, 1]             576
          Conv2d-151            [-1, 64, 1, 56]             576
        CoordAtt-152           [-1, 64, 56, 56]               0
            ReLU-153           [-1, 64, 56, 56]               0
           CARes-154           [-1, 64, 56, 56]               0
          Conv2d-155           [-1, 64, 56, 56]          36,928
     BatchNorm2d-156           [-1, 64, 56, 56]             128
            ReLU-157           [-1, 64, 56, 56]               0
          Conv2d-158           [-1, 64, 56, 56]          36,928
     BatchNorm2d-159           [-1, 64, 56, 56]             128
AdaptiveAvgPool2d-160            [-1, 64, 56, 1]               0
AdaptiveAvgPool2d-161            [-1, 64, 1, 56]               0
          Conv2d-162            [-1, 8, 112, 1]             520
     BatchNorm2d-163            [-1, 8, 112, 1]              16
           ReLU6-164            [-1, 8, 112, 1]               0
       h_sigmoid-165            [-1, 8, 112, 1]               0
         h_swish-166            [-1, 8, 112, 1]               0
          Conv2d-167            [-1, 64, 56, 1]             576
          Conv2d-168            [-1, 64, 1, 56]             576
        CoordAtt-169           [-1, 64, 56, 56]               0
            ReLU-170           [-1, 64, 56, 56]               0
           CARes-171           [-1, 64, 56, 56]               0
 ConvTranspose2d-172         [-1, 32, 113, 113]          32,800
     BatchNorm2d-173         [-1, 32, 113, 113]              64
 ConvTranspose2d-174         [-1, 16, 225, 225]           8,208
     BatchNorm2d-175         [-1, 16, 225, 225]              32
 ConvTranspose2d-176         [-1, 16, 225, 225]          20,752
         Dropout-177         [-1, 16, 225, 225]               0
          Conv2d-178          [-1, 1, 224, 224]              65
         Dropout-179         [-1, 16, 225, 225]               0
          Conv2d-180          [-1, 1, 224, 224]              65
         Dropout-181         [-1, 16, 225, 225]               0
          Conv2d-182          [-1, 1, 224, 224]              65
         Dropout-183         [-1, 16, 225, 225]               0
          Conv2d-184          [-1, 1, 224, 224]              65
================================================================
Total params: 491,932
Trainable params: 491,932
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.57
Forward/backward pass size (MB): 276.84
Params size (MB): 1.88
Estimated Total Size (MB): 279.29
----------------------------------------------------------------
