----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 16, 224, 224]           5,200
       BatchNorm2d-2         [-1, 16, 224, 224]              32
              ReLU-3         [-1, 16, 224, 224]               0
              Conv-4         [-1, 16, 224, 224]               0
            Conv2d-5         [-1, 32, 112, 112]           4,640
       BatchNorm2d-6         [-1, 32, 112, 112]              64
              ReLU-7         [-1, 32, 112, 112]               0
              Conv-8         [-1, 32, 112, 112]               0
            Conv2d-9           [-1, 64, 56, 56]          18,496
      BatchNorm2d-10           [-1, 64, 56, 56]             128
             ReLU-11           [-1, 64, 56, 56]               0
             Conv-12           [-1, 64, 56, 56]               0
           Conv2d-13           [-1, 32, 28, 28]          18,432
      BatchNorm2d-14           [-1, 32, 28, 28]              64
             Mish-15           [-1, 32, 28, 28]               0
        Conv_Mish-16           [-1, 32, 28, 28]               0
           Conv2d-17           [-1, 32, 28, 28]             288
      BatchNorm2d-18           [-1, 32, 28, 28]              64
             Mish-19           [-1, 32, 28, 28]               0
        Conv_Mish-20           [-1, 32, 28, 28]               0
           GSConv-21           [-1, 64, 28, 28]               0
           Conv2d-22           [-1, 32, 28, 28]           2,080
      BatchNorm2d-23           [-1, 32, 28, 28]              64
             ReLU-24           [-1, 32, 28, 28]               0
             Conv-25           [-1, 32, 28, 28]               0
           Conv2d-26            [-1, 8, 28, 28]             256
      BatchNorm2d-27            [-1, 8, 28, 28]              16
             Mish-28            [-1, 8, 28, 28]               0
        Conv_Mish-29            [-1, 8, 28, 28]               0
           Conv2d-30            [-1, 8, 28, 28]              72
      BatchNorm2d-31            [-1, 8, 28, 28]              16
             Mish-32            [-1, 8, 28, 28]               0
        Conv_Mish-33            [-1, 8, 28, 28]               0
           GSConv-34           [-1, 16, 28, 28]               0
           Conv2d-35           [-1, 16, 28, 28]           2,304
      BatchNorm2d-36           [-1, 16, 28, 28]              32
             ReLU-37           [-1, 16, 28, 28]               0
        Conv_Mish-38           [-1, 16, 28, 28]               0
           Conv2d-39           [-1, 16, 28, 28]             144
      BatchNorm2d-40           [-1, 16, 28, 28]              32
             ReLU-41           [-1, 16, 28, 28]               0
        Conv_Mish-42           [-1, 16, 28, 28]               0
           GSConv-43           [-1, 32, 28, 28]               0
     GSBottleneck-44           [-1, 32, 28, 28]               0
           Conv2d-45            [-1, 8, 28, 28]             256
      BatchNorm2d-46            [-1, 8, 28, 28]              16
             Mish-47            [-1, 8, 28, 28]               0
        Conv_Mish-48            [-1, 8, 28, 28]               0
           Conv2d-49            [-1, 8, 28, 28]              72
      BatchNorm2d-50            [-1, 8, 28, 28]              16
             Mish-51            [-1, 8, 28, 28]               0
        Conv_Mish-52            [-1, 8, 28, 28]               0
           GSConv-53           [-1, 16, 28, 28]               0
           Conv2d-54           [-1, 16, 28, 28]           2,304
      BatchNorm2d-55           [-1, 16, 28, 28]              32
             ReLU-56           [-1, 16, 28, 28]               0
        Conv_Mish-57           [-1, 16, 28, 28]               0
           Conv2d-58           [-1, 16, 28, 28]             144
      BatchNorm2d-59           [-1, 16, 28, 28]              32
             ReLU-60           [-1, 16, 28, 28]               0
        Conv_Mish-61           [-1, 16, 28, 28]               0
           GSConv-62           [-1, 32, 28, 28]               0
     GSBottleneck-63           [-1, 32, 28, 28]               0
           Conv2d-64            [-1, 8, 28, 28]             256
      BatchNorm2d-65            [-1, 8, 28, 28]              16
             Mish-66            [-1, 8, 28, 28]               0
        Conv_Mish-67            [-1, 8, 28, 28]               0
           Conv2d-68            [-1, 8, 28, 28]              72
      BatchNorm2d-69            [-1, 8, 28, 28]              16
             Mish-70            [-1, 8, 28, 28]               0
        Conv_Mish-71            [-1, 8, 28, 28]               0
           GSConv-72           [-1, 16, 28, 28]               0
           Conv2d-73           [-1, 16, 28, 28]           2,304
      BatchNorm2d-74           [-1, 16, 28, 28]              32
             ReLU-75           [-1, 16, 28, 28]               0
        Conv_Mish-76           [-1, 16, 28, 28]               0
           Conv2d-77           [-1, 16, 28, 28]             144
      BatchNorm2d-78           [-1, 16, 28, 28]              32
             ReLU-79           [-1, 16, 28, 28]               0
        Conv_Mish-80           [-1, 16, 28, 28]               0
           GSConv-81           [-1, 32, 28, 28]               0
     GSBottleneck-82           [-1, 32, 28, 28]               0
           Conv2d-83           [-1, 32, 28, 28]           2,080
      BatchNorm2d-84           [-1, 32, 28, 28]              64
             ReLU-85           [-1, 32, 28, 28]               0
             Conv-86           [-1, 32, 28, 28]               0
           Conv2d-87           [-1, 64, 28, 28]           4,160
      BatchNorm2d-88           [-1, 64, 28, 28]             128
             ReLU-89           [-1, 64, 28, 28]               0
             Conv-90           [-1, 64, 28, 28]               0
          GS_IRes-91           [-1, 64, 28, 28]               0
           Conv2d-92           [-1, 32, 28, 28]           2,080
      BatchNorm2d-93           [-1, 32, 28, 28]              64
             ReLU-94           [-1, 32, 28, 28]               0
             Conv-95           [-1, 32, 28, 28]               0
           Conv2d-96            [-1, 8, 28, 28]             256
      BatchNorm2d-97            [-1, 8, 28, 28]              16
             Mish-98            [-1, 8, 28, 28]               0
        Conv_Mish-99            [-1, 8, 28, 28]               0
          Conv2d-100            [-1, 8, 28, 28]              72
     BatchNorm2d-101            [-1, 8, 28, 28]              16
            Mish-102            [-1, 8, 28, 28]               0
       Conv_Mish-103            [-1, 8, 28, 28]               0
          GSConv-104           [-1, 16, 28, 28]               0
          Conv2d-105           [-1, 16, 28, 28]           2,304
     BatchNorm2d-106           [-1, 16, 28, 28]              32
            ReLU-107           [-1, 16, 28, 28]               0
       Conv_Mish-108           [-1, 16, 28, 28]               0
          Conv2d-109           [-1, 16, 28, 28]             144
     BatchNorm2d-110           [-1, 16, 28, 28]              32
            ReLU-111           [-1, 16, 28, 28]               0
       Conv_Mish-112           [-1, 16, 28, 28]               0
          GSConv-113           [-1, 32, 28, 28]               0
    GSBottleneck-114           [-1, 32, 28, 28]               0
          Conv2d-115            [-1, 8, 28, 28]             256
     BatchNorm2d-116            [-1, 8, 28, 28]              16
            Mish-117            [-1, 8, 28, 28]               0
       Conv_Mish-118            [-1, 8, 28, 28]               0
          Conv2d-119            [-1, 8, 28, 28]              72
     BatchNorm2d-120            [-1, 8, 28, 28]              16
            Mish-121            [-1, 8, 28, 28]               0
       Conv_Mish-122            [-1, 8, 28, 28]               0
          GSConv-123           [-1, 16, 28, 28]               0
          Conv2d-124           [-1, 16, 28, 28]           2,304
     BatchNorm2d-125           [-1, 16, 28, 28]              32
            ReLU-126           [-1, 16, 28, 28]               0
       Conv_Mish-127           [-1, 16, 28, 28]               0
          Conv2d-128           [-1, 16, 28, 28]             144
     BatchNorm2d-129           [-1, 16, 28, 28]              32
            ReLU-130           [-1, 16, 28, 28]               0
       Conv_Mish-131           [-1, 16, 28, 28]               0
          GSConv-132           [-1, 32, 28, 28]               0
    GSBottleneck-133           [-1, 32, 28, 28]               0
          Conv2d-134            [-1, 8, 28, 28]             256
     BatchNorm2d-135            [-1, 8, 28, 28]              16
            Mish-136            [-1, 8, 28, 28]               0
       Conv_Mish-137            [-1, 8, 28, 28]               0
          Conv2d-138            [-1, 8, 28, 28]              72
     BatchNorm2d-139            [-1, 8, 28, 28]              16
            Mish-140            [-1, 8, 28, 28]               0
       Conv_Mish-141            [-1, 8, 28, 28]               0
          GSConv-142           [-1, 16, 28, 28]               0
          Conv2d-143           [-1, 16, 28, 28]           2,304
     BatchNorm2d-144           [-1, 16, 28, 28]              32
            ReLU-145           [-1, 16, 28, 28]               0
       Conv_Mish-146           [-1, 16, 28, 28]               0
          Conv2d-147           [-1, 16, 28, 28]             144
     BatchNorm2d-148           [-1, 16, 28, 28]              32
            ReLU-149           [-1, 16, 28, 28]               0
       Conv_Mish-150           [-1, 16, 28, 28]               0
          GSConv-151           [-1, 32, 28, 28]               0
    GSBottleneck-152           [-1, 32, 28, 28]               0
          Conv2d-153           [-1, 32, 28, 28]           2,080
     BatchNorm2d-154           [-1, 32, 28, 28]              64
            ReLU-155           [-1, 32, 28, 28]               0
            Conv-156           [-1, 32, 28, 28]               0
          Conv2d-157           [-1, 64, 28, 28]           4,160
     BatchNorm2d-158           [-1, 64, 28, 28]             128
            ReLU-159           [-1, 64, 28, 28]               0
            Conv-160           [-1, 64, 28, 28]               0
         GS_IRes-161           [-1, 64, 28, 28]               0
          Conv2d-162           [-1, 32, 28, 28]           2,080
     BatchNorm2d-163           [-1, 32, 28, 28]              64
            ReLU-164           [-1, 32, 28, 28]               0
            Conv-165           [-1, 32, 28, 28]               0
          Conv2d-166            [-1, 8, 28, 28]             256
     BatchNorm2d-167            [-1, 8, 28, 28]              16
            Mish-168            [-1, 8, 28, 28]               0
       Conv_Mish-169            [-1, 8, 28, 28]               0
          Conv2d-170            [-1, 8, 28, 28]              72
     BatchNorm2d-171            [-1, 8, 28, 28]              16
            Mish-172            [-1, 8, 28, 28]               0
       Conv_Mish-173            [-1, 8, 28, 28]               0
          GSConv-174           [-1, 16, 28, 28]               0
          Conv2d-175           [-1, 16, 28, 28]           2,304
     BatchNorm2d-176           [-1, 16, 28, 28]              32
            ReLU-177           [-1, 16, 28, 28]               0
       Conv_Mish-178           [-1, 16, 28, 28]               0
          Conv2d-179           [-1, 16, 28, 28]             144
     BatchNorm2d-180           [-1, 16, 28, 28]              32
            ReLU-181           [-1, 16, 28, 28]               0
       Conv_Mish-182           [-1, 16, 28, 28]               0
          GSConv-183           [-1, 32, 28, 28]               0
    GSBottleneck-184           [-1, 32, 28, 28]               0
          Conv2d-185           [-1, 32, 28, 28]           2,080
     BatchNorm2d-186           [-1, 32, 28, 28]              64
            ReLU-187           [-1, 32, 28, 28]               0
            Conv-188           [-1, 32, 28, 28]               0
          Conv2d-189           [-1, 64, 28, 28]           4,160
     BatchNorm2d-190           [-1, 64, 28, 28]             128
            ReLU-191           [-1, 64, 28, 28]               0
            Conv-192           [-1, 64, 28, 28]               0
         GS_IRes-193           [-1, 64, 28, 28]               0
 ConvTranspose2d-194           [-1, 32, 56, 56]          32,800
     BatchNorm2d-195           [-1, 32, 56, 56]              64
           Trans-196           [-1, 32, 56, 56]               0
 ConvTranspose2d-197         [-1, 16, 112, 112]           8,208
     BatchNorm2d-198         [-1, 16, 112, 112]              32
           Trans-199         [-1, 16, 112, 112]               0
 ConvTranspose2d-200         [-1, 16, 225, 225]           4,112
     BatchNorm2d-201         [-1, 16, 225, 225]              32
           Trans-202         [-1, 16, 225, 225]               0
 ConvTranspose2d-203         [-1, 16, 225, 225]          20,752
           Trans-204         [-1, 16, 225, 225]               0
         Dropout-205         [-1, 16, 225, 225]               0
          Conv2d-206          [-1, 1, 224, 224]              65
         Dropout-207         [-1, 16, 225, 225]               0
          Conv2d-208          [-1, 1, 224, 224]              65
         Dropout-209         [-1, 16, 225, 225]               0
          Conv2d-210          [-1, 1, 224, 224]              65
         Dropout-211         [-1, 16, 225, 225]               0
          Conv2d-212          [-1, 1, 224, 224]              65
================================================================
Total params: 159,500
Trainable params: 64,940
Non-trainable params: 94,560
----------------------------------------------------------------
Input size (MB): 0.77
Forward/backward pass size (MB): 130.55
Params size (MB): 0.61
Estimated Total Size (MB): 131.93
----------------------------------------------------------------
