----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 16, 224, 224]           5,200
       BatchNorm2d-2         [-1, 16, 224, 224]              32
              ReLU-3         [-1, 16, 224, 224]               0
              Conv-4         [-1, 16, 224, 224]               0
            Conv2d-5         [-1, 32, 112, 112]           8,224
       BatchNorm2d-6         [-1, 32, 112, 112]              64
              ReLU-7         [-1, 32, 112, 112]               0
              Conv-8         [-1, 32, 112, 112]               0
            Conv2d-9           [-1, 64, 56, 56]          32,832
      BatchNorm2d-10           [-1, 64, 56, 56]             128
             ReLU-11           [-1, 64, 56, 56]               0
             Conv-12           [-1, 64, 56, 56]               0
           Conv2d-13           [-1, 32, 56, 56]           2,080
      BatchNorm2d-14           [-1, 32, 56, 56]              64
             ReLU-15           [-1, 32, 56, 56]               0
             Conv-16           [-1, 32, 56, 56]               0
           Conv2d-17            [-1, 8, 56, 56]             256
      BatchNorm2d-18            [-1, 8, 56, 56]              16
             Mish-19            [-1, 8, 56, 56]               0
        Conv_Mish-20            [-1, 8, 56, 56]               0
           Conv2d-21            [-1, 8, 56, 56]              72
      BatchNorm2d-22            [-1, 8, 56, 56]              16
             Mish-23            [-1, 8, 56, 56]               0
        Conv_Mish-24            [-1, 8, 56, 56]               0
           GSConv-25           [-1, 16, 56, 56]               0
           Conv2d-26           [-1, 16, 56, 56]           2,304
      BatchNorm2d-27           [-1, 16, 56, 56]              32
             Mish-28           [-1, 16, 56, 56]               0
        Conv_Mish-29           [-1, 16, 56, 56]               0
           Conv2d-30           [-1, 16, 56, 56]             144
      BatchNorm2d-31           [-1, 16, 56, 56]              32
             Mish-32           [-1, 16, 56, 56]               0
        Conv_Mish-33           [-1, 16, 56, 56]               0
           GSConv-34           [-1, 32, 56, 56]               0
     GSBottleneck-35           [-1, 32, 56, 56]               0
           Conv2d-36           [-1, 32, 56, 56]           2,080
      BatchNorm2d-37           [-1, 32, 56, 56]              64
             ReLU-38           [-1, 32, 56, 56]               0
             Conv-39           [-1, 32, 56, 56]               0
           Conv2d-40           [-1, 32, 56, 56]           9,248
      BatchNorm2d-41           [-1, 32, 56, 56]              64
             ReLU-42           [-1, 32, 56, 56]               0
             Conv-43           [-1, 32, 56, 56]               0
           Conv2d-44           [-1, 32, 56, 56]           9,248
      BatchNorm2d-45           [-1, 32, 56, 56]              64
             ReLU-46           [-1, 32, 56, 56]               0
             Conv-47           [-1, 32, 56, 56]               0
           Conv2d-48           [-1, 32, 56, 56]           2,080
      BatchNorm2d-49           [-1, 32, 56, 56]              64
             ReLU-50           [-1, 32, 56, 56]               0
             Conv-51           [-1, 32, 56, 56]               0
           Conv2d-52           [-1, 64, 56, 56]           6,208
      BatchNorm2d-53           [-1, 64, 56, 56]             128
             ReLU-54           [-1, 64, 56, 56]               0
             Conv-55           [-1, 64, 56, 56]               0
          GS_IRes-56           [-1, 64, 56, 56]               0
           Conv2d-57           [-1, 32, 56, 56]           2,080
      BatchNorm2d-58           [-1, 32, 56, 56]              64
             ReLU-59           [-1, 32, 56, 56]               0
             Conv-60           [-1, 32, 56, 56]               0
           Conv2d-61            [-1, 8, 56, 56]             256
      BatchNorm2d-62            [-1, 8, 56, 56]              16
             Mish-63            [-1, 8, 56, 56]               0
        Conv_Mish-64            [-1, 8, 56, 56]               0
           Conv2d-65            [-1, 8, 56, 56]              72
      BatchNorm2d-66            [-1, 8, 56, 56]              16
             Mish-67            [-1, 8, 56, 56]               0
        Conv_Mish-68            [-1, 8, 56, 56]               0
           GSConv-69           [-1, 16, 56, 56]               0
           Conv2d-70           [-1, 16, 56, 56]           2,304
      BatchNorm2d-71           [-1, 16, 56, 56]              32
             Mish-72           [-1, 16, 56, 56]               0
        Conv_Mish-73           [-1, 16, 56, 56]               0
           Conv2d-74           [-1, 16, 56, 56]             144
      BatchNorm2d-75           [-1, 16, 56, 56]              32
             Mish-76           [-1, 16, 56, 56]               0
        Conv_Mish-77           [-1, 16, 56, 56]               0
           GSConv-78           [-1, 32, 56, 56]               0
     GSBottleneck-79           [-1, 32, 56, 56]               0
           Conv2d-80           [-1, 32, 56, 56]           2,080
      BatchNorm2d-81           [-1, 32, 56, 56]              64
             ReLU-82           [-1, 32, 56, 56]               0
             Conv-83           [-1, 32, 56, 56]               0
           Conv2d-84           [-1, 32, 56, 56]           9,248
      BatchNorm2d-85           [-1, 32, 56, 56]              64
             ReLU-86           [-1, 32, 56, 56]               0
             Conv-87           [-1, 32, 56, 56]               0
           Conv2d-88           [-1, 32, 56, 56]           9,248
      BatchNorm2d-89           [-1, 32, 56, 56]              64
             ReLU-90           [-1, 32, 56, 56]               0
             Conv-91           [-1, 32, 56, 56]               0
           Conv2d-92           [-1, 32, 56, 56]           2,080
      BatchNorm2d-93           [-1, 32, 56, 56]              64
             ReLU-94           [-1, 32, 56, 56]               0
             Conv-95           [-1, 32, 56, 56]               0
           Conv2d-96           [-1, 64, 56, 56]           6,208
      BatchNorm2d-97           [-1, 64, 56, 56]             128
             ReLU-98           [-1, 64, 56, 56]               0
             Conv-99           [-1, 64, 56, 56]               0
         GS_IRes-100           [-1, 64, 56, 56]               0
          Conv2d-101           [-1, 32, 56, 56]           2,080
     BatchNorm2d-102           [-1, 32, 56, 56]              64
            ReLU-103           [-1, 32, 56, 56]               0
            Conv-104           [-1, 32, 56, 56]               0
          Conv2d-105            [-1, 8, 56, 56]             256
     BatchNorm2d-106            [-1, 8, 56, 56]              16
            Mish-107            [-1, 8, 56, 56]               0
       Conv_Mish-108            [-1, 8, 56, 56]               0
          Conv2d-109            [-1, 8, 56, 56]              72
     BatchNorm2d-110            [-1, 8, 56, 56]              16
            Mish-111            [-1, 8, 56, 56]               0
       Conv_Mish-112            [-1, 8, 56, 56]               0
          GSConv-113           [-1, 16, 56, 56]               0
          Conv2d-114           [-1, 16, 56, 56]           2,304
     BatchNorm2d-115           [-1, 16, 56, 56]              32
            Mish-116           [-1, 16, 56, 56]               0
       Conv_Mish-117           [-1, 16, 56, 56]               0
          Conv2d-118           [-1, 16, 56, 56]             144
     BatchNorm2d-119           [-1, 16, 56, 56]              32
            Mish-120           [-1, 16, 56, 56]               0
       Conv_Mish-121           [-1, 16, 56, 56]               0
          GSConv-122           [-1, 32, 56, 56]               0
    GSBottleneck-123           [-1, 32, 56, 56]               0
          Conv2d-124           [-1, 32, 56, 56]           2,080
     BatchNorm2d-125           [-1, 32, 56, 56]              64
            ReLU-126           [-1, 32, 56, 56]               0
            Conv-127           [-1, 32, 56, 56]               0
          Conv2d-128           [-1, 32, 56, 56]           9,248
     BatchNorm2d-129           [-1, 32, 56, 56]              64
            ReLU-130           [-1, 32, 56, 56]               0
            Conv-131           [-1, 32, 56, 56]               0
          Conv2d-132           [-1, 32, 56, 56]           9,248
     BatchNorm2d-133           [-1, 32, 56, 56]              64
            ReLU-134           [-1, 32, 56, 56]               0
            Conv-135           [-1, 32, 56, 56]               0
          Conv2d-136           [-1, 32, 56, 56]           2,080
     BatchNorm2d-137           [-1, 32, 56, 56]              64
            ReLU-138           [-1, 32, 56, 56]               0
            Conv-139           [-1, 32, 56, 56]               0
          Conv2d-140           [-1, 64, 56, 56]           6,208
     BatchNorm2d-141           [-1, 64, 56, 56]             128
            ReLU-142           [-1, 64, 56, 56]               0
            Conv-143           [-1, 64, 56, 56]               0
         GS_IRes-144           [-1, 64, 56, 56]               0
          Conv2d-145           [-1, 32, 56, 56]           2,080
     BatchNorm2d-146           [-1, 32, 56, 56]              64
            ReLU-147           [-1, 32, 56, 56]               0
            Conv-148           [-1, 32, 56, 56]               0
          Conv2d-149            [-1, 8, 56, 56]             256
     BatchNorm2d-150            [-1, 8, 56, 56]              16
            Mish-151            [-1, 8, 56, 56]               0
       Conv_Mish-152            [-1, 8, 56, 56]               0
          Conv2d-153            [-1, 8, 56, 56]              72
     BatchNorm2d-154            [-1, 8, 56, 56]              16
            Mish-155            [-1, 8, 56, 56]               0
       Conv_Mish-156            [-1, 8, 56, 56]               0
          GSConv-157           [-1, 16, 56, 56]               0
          Conv2d-158           [-1, 16, 56, 56]           2,304
     BatchNorm2d-159           [-1, 16, 56, 56]              32
            Mish-160           [-1, 16, 56, 56]               0
       Conv_Mish-161           [-1, 16, 56, 56]               0
          Conv2d-162           [-1, 16, 56, 56]             144
     BatchNorm2d-163           [-1, 16, 56, 56]              32
            Mish-164           [-1, 16, 56, 56]               0
       Conv_Mish-165           [-1, 16, 56, 56]               0
          GSConv-166           [-1, 32, 56, 56]               0
    GSBottleneck-167           [-1, 32, 56, 56]               0
          Conv2d-168           [-1, 32, 56, 56]           2,080
     BatchNorm2d-169           [-1, 32, 56, 56]              64
            ReLU-170           [-1, 32, 56, 56]               0
            Conv-171           [-1, 32, 56, 56]               0
          Conv2d-172           [-1, 32, 56, 56]           9,248
     BatchNorm2d-173           [-1, 32, 56, 56]              64
            ReLU-174           [-1, 32, 56, 56]               0
            Conv-175           [-1, 32, 56, 56]               0
          Conv2d-176           [-1, 32, 56, 56]           9,248
     BatchNorm2d-177           [-1, 32, 56, 56]              64
            ReLU-178           [-1, 32, 56, 56]               0
            Conv-179           [-1, 32, 56, 56]               0
          Conv2d-180           [-1, 32, 56, 56]           2,080
     BatchNorm2d-181           [-1, 32, 56, 56]              64
            ReLU-182           [-1, 32, 56, 56]               0
            Conv-183           [-1, 32, 56, 56]               0
          Conv2d-184           [-1, 64, 56, 56]           6,208
     BatchNorm2d-185           [-1, 64, 56, 56]             128
            ReLU-186           [-1, 64, 56, 56]               0
            Conv-187           [-1, 64, 56, 56]               0
         GS_IRes-188           [-1, 64, 56, 56]               0
          Conv2d-189           [-1, 32, 56, 56]           2,080
     BatchNorm2d-190           [-1, 32, 56, 56]              64
            ReLU-191           [-1, 32, 56, 56]               0
            Conv-192           [-1, 32, 56, 56]               0
          Conv2d-193            [-1, 8, 56, 56]             256
     BatchNorm2d-194            [-1, 8, 56, 56]              16
            Mish-195            [-1, 8, 56, 56]               0
       Conv_Mish-196            [-1, 8, 56, 56]               0
          Conv2d-197            [-1, 8, 56, 56]              72
     BatchNorm2d-198            [-1, 8, 56, 56]              16
            Mish-199            [-1, 8, 56, 56]               0
       Conv_Mish-200            [-1, 8, 56, 56]               0
          GSConv-201           [-1, 16, 56, 56]               0
          Conv2d-202           [-1, 16, 56, 56]           2,304
     BatchNorm2d-203           [-1, 16, 56, 56]              32
            Mish-204           [-1, 16, 56, 56]               0
       Conv_Mish-205           [-1, 16, 56, 56]               0
          Conv2d-206           [-1, 16, 56, 56]             144
     BatchNorm2d-207           [-1, 16, 56, 56]              32
            Mish-208           [-1, 16, 56, 56]               0
       Conv_Mish-209           [-1, 16, 56, 56]               0
          GSConv-210           [-1, 32, 56, 56]               0
    GSBottleneck-211           [-1, 32, 56, 56]               0
          Conv2d-212           [-1, 32, 56, 56]           2,080
     BatchNorm2d-213           [-1, 32, 56, 56]              64
            ReLU-214           [-1, 32, 56, 56]               0
            Conv-215           [-1, 32, 56, 56]               0
          Conv2d-216           [-1, 32, 56, 56]           9,248
     BatchNorm2d-217           [-1, 32, 56, 56]              64
            ReLU-218           [-1, 32, 56, 56]               0
            Conv-219           [-1, 32, 56, 56]               0
          Conv2d-220           [-1, 32, 56, 56]           9,248
     BatchNorm2d-221           [-1, 32, 56, 56]              64
            ReLU-222           [-1, 32, 56, 56]               0
            Conv-223           [-1, 32, 56, 56]               0
          Conv2d-224           [-1, 32, 56, 56]           2,080
     BatchNorm2d-225           [-1, 32, 56, 56]              64
            ReLU-226           [-1, 32, 56, 56]               0
            Conv-227           [-1, 32, 56, 56]               0
          Conv2d-228           [-1, 64, 56, 56]           6,208
     BatchNorm2d-229           [-1, 64, 56, 56]             128
            ReLU-230           [-1, 64, 56, 56]               0
            Conv-231           [-1, 64, 56, 56]               0
         GS_IRes-232           [-1, 64, 56, 56]               0
 ConvTranspose2d-233         [-1, 32, 113, 113]          32,800
     BatchNorm2d-234         [-1, 32, 113, 113]              64
           Trans-235         [-1, 32, 113, 113]               0
 ConvTranspose2d-236         [-1, 16, 225, 225]           8,208
     BatchNorm2d-237         [-1, 16, 225, 225]              32
           Trans-238         [-1, 16, 225, 225]               0
 ConvTranspose2d-239         [-1, 16, 225, 225]          20,752
           Trans-240         [-1, 16, 225, 225]               0
         Dropout-241         [-1, 16, 225, 225]               0
          Conv2d-242          [-1, 1, 224, 224]              65
         Dropout-243         [-1, 16, 225, 225]               0
          Conv2d-244          [-1, 1, 224, 224]              65
         Dropout-245         [-1, 16, 225, 225]               0
          Conv2d-246          [-1, 1, 224, 224]              65
         Dropout-247         [-1, 16, 225, 225]               0
          Conv2d-248          [-1, 1, 224, 224]              65
================================================================
Total params: 279,916
Trainable params: 171,580
Non-trainable params: 108,336
----------------------------------------------------------------
Input size (MB): 0.77
Forward/backward pass size (MB): 256.76
Params size (MB): 1.07
Estimated Total Size (MB): 258.59
----------------------------------------------------------------
