----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 16, 224, 224]           5,200
       BatchNorm2d-2         [-1, 16, 224, 224]              32
              ReLU-3         [-1, 16, 224, 224]               0
              Conv-4         [-1, 16, 224, 224]               0
            Conv2d-5         [-1, 32, 112, 112]           4,640
       BatchNorm2d-6         [-1, 32, 112, 112]              64
              ReLU-7         [-1, 32, 112, 112]               0
              Conv-8         [-1, 32, 112, 112]               0
            Conv2d-9           [-1, 64, 56, 56]          18,496
      BatchNorm2d-10           [-1, 64, 56, 56]             128
             ReLU-11           [-1, 64, 56, 56]               0
             Conv-12           [-1, 64, 56, 56]               0
           Conv2d-13           [-1, 16, 56, 56]           1,024
      BatchNorm2d-14           [-1, 16, 56, 56]              32
             Mish-15           [-1, 16, 56, 56]               0
        Conv_Mish-16           [-1, 16, 56, 56]               0
           Conv2d-17           [-1, 16, 56, 56]             144
      BatchNorm2d-18           [-1, 16, 56, 56]              32
             Mish-19           [-1, 16, 56, 56]               0
        Conv_Mish-20           [-1, 16, 56, 56]               0
           GSConv-21           [-1, 32, 56, 56]               0
           Conv2d-22           [-1, 32, 28, 28]           9,216
      BatchNorm2d-23           [-1, 32, 28, 28]              64
         Identity-24           [-1, 32, 28, 28]               0
        Conv_Mish-25           [-1, 32, 28, 28]               0
           Conv2d-26           [-1, 32, 28, 28]             288
      BatchNorm2d-27           [-1, 32, 28, 28]              64
         Identity-28           [-1, 32, 28, 28]               0
        Conv_Mish-29           [-1, 32, 28, 28]               0
           GSConv-30           [-1, 64, 28, 28]               0
     GSBottleneck-31           [-1, 64, 28, 28]               0
           Conv2d-32           [-1, 32, 28, 28]           2,080
      BatchNorm2d-33           [-1, 32, 28, 28]              64
             ReLU-34           [-1, 32, 28, 28]               0
             Conv-35           [-1, 32, 28, 28]               0
           Conv2d-36           [-1, 16, 28, 28]             512
      BatchNorm2d-37           [-1, 16, 28, 28]              32
             Mish-38           [-1, 16, 28, 28]               0
        Conv_Mish-39           [-1, 16, 28, 28]               0
           Conv2d-40           [-1, 16, 28, 28]             144
      BatchNorm2d-41           [-1, 16, 28, 28]              32
             Mish-42           [-1, 16, 28, 28]               0
        Conv_Mish-43           [-1, 16, 28, 28]               0
           GSConv-44           [-1, 32, 28, 28]               0
           Conv2d-45           [-1, 16, 28, 28]           4,608
      BatchNorm2d-46           [-1, 16, 28, 28]              32
         Identity-47           [-1, 16, 28, 28]               0
        Conv_Mish-48           [-1, 16, 28, 28]               0
           Conv2d-49           [-1, 16, 28, 28]             144
      BatchNorm2d-50           [-1, 16, 28, 28]              32
         Identity-51           [-1, 16, 28, 28]               0
        Conv_Mish-52           [-1, 16, 28, 28]               0
           GSConv-53           [-1, 32, 28, 28]               0
     GSBottleneck-54           [-1, 32, 28, 28]               0
           Conv2d-55           [-1, 32, 28, 28]           2,080
      BatchNorm2d-56           [-1, 32, 28, 28]              64
             ReLU-57           [-1, 32, 28, 28]               0
             Conv-58           [-1, 32, 28, 28]               0
AdaptiveAvgPool2d-59            [-1, 32, 28, 1]               0
AdaptiveAvgPool2d-60            [-1, 32, 1, 28]               0
           Conv2d-61             [-1, 8, 56, 1]             264
      BatchNorm2d-62             [-1, 8, 56, 1]              16
            ReLU6-63             [-1, 8, 56, 1]               0
        h_sigmoid-64             [-1, 8, 56, 1]               0
          h_swish-65             [-1, 8, 56, 1]               0
           Conv2d-66            [-1, 32, 28, 1]             288
           Conv2d-67            [-1, 32, 1, 28]             288
         CoordAtt-68           [-1, 32, 28, 28]               0
           Conv2d-69           [-1, 64, 28, 28]           4,160
      BatchNorm2d-70           [-1, 64, 28, 28]             128
             ReLU-71           [-1, 64, 28, 28]               0
             Conv-72           [-1, 64, 28, 28]               0
      VoVGSCSP_CA-73           [-1, 64, 28, 28]               0
           Conv2d-74           [-1, 32, 28, 28]           2,080
      BatchNorm2d-75           [-1, 32, 28, 28]              64
             ReLU-76           [-1, 32, 28, 28]               0
             Conv-77           [-1, 32, 28, 28]               0
           Conv2d-78           [-1, 16, 28, 28]             512
      BatchNorm2d-79           [-1, 16, 28, 28]              32
             Mish-80           [-1, 16, 28, 28]               0
        Conv_Mish-81           [-1, 16, 28, 28]               0
           Conv2d-82           [-1, 16, 28, 28]             144
      BatchNorm2d-83           [-1, 16, 28, 28]              32
             Mish-84           [-1, 16, 28, 28]               0
        Conv_Mish-85           [-1, 16, 28, 28]               0
           GSConv-86           [-1, 32, 28, 28]               0
           Conv2d-87           [-1, 16, 28, 28]           4,608
      BatchNorm2d-88           [-1, 16, 28, 28]              32
         Identity-89           [-1, 16, 28, 28]               0
        Conv_Mish-90           [-1, 16, 28, 28]               0
           Conv2d-91           [-1, 16, 28, 28]             144
      BatchNorm2d-92           [-1, 16, 28, 28]              32
         Identity-93           [-1, 16, 28, 28]               0
        Conv_Mish-94           [-1, 16, 28, 28]               0
           GSConv-95           [-1, 32, 28, 28]               0
     GSBottleneck-96           [-1, 32, 28, 28]               0
           Conv2d-97           [-1, 32, 28, 28]           2,080
      BatchNorm2d-98           [-1, 32, 28, 28]              64
             ReLU-99           [-1, 32, 28, 28]               0
            Conv-100           [-1, 32, 28, 28]               0
AdaptiveAvgPool2d-101            [-1, 32, 28, 1]               0
AdaptiveAvgPool2d-102            [-1, 32, 1, 28]               0
          Conv2d-103             [-1, 8, 56, 1]             264
     BatchNorm2d-104             [-1, 8, 56, 1]              16
           ReLU6-105             [-1, 8, 56, 1]               0
       h_sigmoid-106             [-1, 8, 56, 1]               0
         h_swish-107             [-1, 8, 56, 1]               0
          Conv2d-108            [-1, 32, 28, 1]             288
          Conv2d-109            [-1, 32, 1, 28]             288
        CoordAtt-110           [-1, 32, 28, 28]               0
          Conv2d-111           [-1, 64, 28, 28]           4,160
     BatchNorm2d-112           [-1, 64, 28, 28]             128
            ReLU-113           [-1, 64, 28, 28]               0
            Conv-114           [-1, 64, 28, 28]               0
     VoVGSCSP_CA-115           [-1, 64, 28, 28]               0
          Conv2d-116           [-1, 32, 28, 28]           2,080
     BatchNorm2d-117           [-1, 32, 28, 28]              64
            ReLU-118           [-1, 32, 28, 28]               0
            Conv-119           [-1, 32, 28, 28]               0
          Conv2d-120           [-1, 16, 28, 28]             512
     BatchNorm2d-121           [-1, 16, 28, 28]              32
            Mish-122           [-1, 16, 28, 28]               0
       Conv_Mish-123           [-1, 16, 28, 28]               0
          Conv2d-124           [-1, 16, 28, 28]             144
     BatchNorm2d-125           [-1, 16, 28, 28]              32
            Mish-126           [-1, 16, 28, 28]               0
       Conv_Mish-127           [-1, 16, 28, 28]               0
          GSConv-128           [-1, 32, 28, 28]               0
          Conv2d-129           [-1, 16, 28, 28]           4,608
     BatchNorm2d-130           [-1, 16, 28, 28]              32
        Identity-131           [-1, 16, 28, 28]               0
       Conv_Mish-132           [-1, 16, 28, 28]               0
          Conv2d-133           [-1, 16, 28, 28]             144
     BatchNorm2d-134           [-1, 16, 28, 28]              32
        Identity-135           [-1, 16, 28, 28]               0
       Conv_Mish-136           [-1, 16, 28, 28]               0
          GSConv-137           [-1, 32, 28, 28]               0
    GSBottleneck-138           [-1, 32, 28, 28]               0
          Conv2d-139           [-1, 32, 28, 28]           2,080
     BatchNorm2d-140           [-1, 32, 28, 28]              64
            ReLU-141           [-1, 32, 28, 28]               0
            Conv-142           [-1, 32, 28, 28]               0
AdaptiveAvgPool2d-143            [-1, 32, 28, 1]               0
AdaptiveAvgPool2d-144            [-1, 32, 1, 28]               0
          Conv2d-145             [-1, 8, 56, 1]             264
     BatchNorm2d-146             [-1, 8, 56, 1]              16
           ReLU6-147             [-1, 8, 56, 1]               0
       h_sigmoid-148             [-1, 8, 56, 1]               0
         h_swish-149             [-1, 8, 56, 1]               0
          Conv2d-150            [-1, 32, 28, 1]             288
          Conv2d-151            [-1, 32, 1, 28]             288
        CoordAtt-152           [-1, 32, 28, 28]               0
          Conv2d-153           [-1, 64, 28, 28]           4,160
     BatchNorm2d-154           [-1, 64, 28, 28]             128
            ReLU-155           [-1, 64, 28, 28]               0
            Conv-156           [-1, 64, 28, 28]               0
     VoVGSCSP_CA-157           [-1, 64, 28, 28]               0
          Conv2d-158           [-1, 64, 28, 28]          36,928
     BatchNorm2d-159           [-1, 64, 28, 28]             128
            ReLU-160           [-1, 64, 28, 28]               0
          Conv2d-161           [-1, 64, 28, 28]          36,928
     BatchNorm2d-162           [-1, 64, 28, 28]             128
AdaptiveAvgPool2d-163            [-1, 64, 28, 1]               0
AdaptiveAvgPool2d-164            [-1, 64, 1, 28]               0
          Conv2d-165             [-1, 8, 56, 1]             520
     BatchNorm2d-166             [-1, 8, 56, 1]              16
           ReLU6-167             [-1, 8, 56, 1]               0
       h_sigmoid-168             [-1, 8, 56, 1]               0
         h_swish-169             [-1, 8, 56, 1]               0
          Conv2d-170            [-1, 64, 28, 1]             576
          Conv2d-171            [-1, 64, 1, 28]             576
        CoordAtt-172           [-1, 64, 28, 28]               0
            ReLU-173           [-1, 64, 28, 28]               0
           CARes-174           [-1, 64, 28, 28]               0
          Conv2d-175           [-1, 64, 28, 28]          36,928
     BatchNorm2d-176           [-1, 64, 28, 28]             128
            ReLU-177           [-1, 64, 28, 28]               0
          Conv2d-178           [-1, 64, 28, 28]          36,928
     BatchNorm2d-179           [-1, 64, 28, 28]             128
AdaptiveAvgPool2d-180            [-1, 64, 28, 1]               0
AdaptiveAvgPool2d-181            [-1, 64, 1, 28]               0
          Conv2d-182             [-1, 8, 56, 1]             520
     BatchNorm2d-183             [-1, 8, 56, 1]              16
           ReLU6-184             [-1, 8, 56, 1]               0
       h_sigmoid-185             [-1, 8, 56, 1]               0
         h_swish-186             [-1, 8, 56, 1]               0
          Conv2d-187            [-1, 64, 28, 1]             576
          Conv2d-188            [-1, 64, 1, 28]             576
        CoordAtt-189           [-1, 64, 28, 28]               0
            ReLU-190           [-1, 64, 28, 28]               0
           CARes-191           [-1, 64, 28, 28]               0
 ConvTranspose2d-192           [-1, 32, 56, 56]          32,800
     BatchNorm2d-193           [-1, 32, 56, 56]              64
           Trans-194           [-1, 32, 56, 56]               0
 ConvTranspose2d-195         [-1, 16, 112, 112]           8,208
     BatchNorm2d-196         [-1, 16, 112, 112]              32
           Trans-197         [-1, 16, 112, 112]               0
 ConvTranspose2d-198         [-1, 16, 225, 225]           4,112
     BatchNorm2d-199         [-1, 16, 225, 225]              32
           Trans-200         [-1, 16, 225, 225]               0
 ConvTranspose2d-201         [-1, 16, 225, 225]          20,752
           Trans-202         [-1, 16, 225, 225]               0
         Dropout-203         [-1, 16, 225, 225]               0
          Conv2d-204          [-1, 1, 224, 224]              65
         Dropout-205         [-1, 16, 225, 225]               0
          Conv2d-206          [-1, 1, 224, 224]              65
         Dropout-207         [-1, 16, 225, 225]               0
          Conv2d-208          [-1, 1, 224, 224]              65
         Dropout-209         [-1, 16, 225, 225]               0
          Conv2d-210          [-1, 1, 224, 224]              65
================================================================
Total params: 302,188
Trainable params: 302,188
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.77
Forward/backward pass size (MB): 136.67
Params size (MB): 1.15
Estimated Total Size (MB): 138.59
----------------------------------------------------------------
