----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 16, 224, 224]           5,200
       BatchNorm2d-2         [-1, 16, 224, 224]              32
              ReLU-3         [-1, 16, 224, 224]               0
              Conv-4         [-1, 16, 224, 224]               0
            Conv2d-5         [-1, 32, 112, 112]           4,640
       BatchNorm2d-6         [-1, 32, 112, 112]              64
              ReLU-7         [-1, 32, 112, 112]               0
              Conv-8         [-1, 32, 112, 112]               0
            Conv2d-9           [-1, 64, 56, 56]          18,496
      BatchNorm2d-10           [-1, 64, 56, 56]             128
             ReLU-11           [-1, 64, 56, 56]               0
             Conv-12           [-1, 64, 56, 56]               0
           Conv2d-13           [-1, 16, 56, 56]           1,024
      BatchNorm2d-14           [-1, 16, 56, 56]              32
             Mish-15           [-1, 16, 56, 56]               0
        Conv_Mish-16           [-1, 16, 56, 56]               0
           Conv2d-17           [-1, 16, 56, 56]             144
      BatchNorm2d-18           [-1, 16, 56, 56]              32
             Mish-19           [-1, 16, 56, 56]               0
        Conv_Mish-20           [-1, 16, 56, 56]               0
           GSConv-21           [-1, 32, 56, 56]               0
           Conv2d-22           [-1, 32, 28, 28]           9,216
      BatchNorm2d-23           [-1, 32, 28, 28]              64
             ReLU-24           [-1, 32, 28, 28]               0
        Conv_Mish-25           [-1, 32, 28, 28]               0
           Conv2d-26           [-1, 32, 28, 28]             288
      BatchNorm2d-27           [-1, 32, 28, 28]              64
             ReLU-28           [-1, 32, 28, 28]               0
        Conv_Mish-29           [-1, 32, 28, 28]               0
           GSConv-30           [-1, 64, 28, 28]               0
     GSBottleneck-31           [-1, 64, 28, 28]               0
           Conv2d-32           [-1, 32, 28, 28]           2,080
      BatchNorm2d-33           [-1, 32, 28, 28]              64
             ReLU-34           [-1, 32, 28, 28]               0
             Conv-35           [-1, 32, 28, 28]               0
           Conv2d-36           [-1, 16, 28, 28]             512
      BatchNorm2d-37           [-1, 16, 28, 28]              32
             Mish-38           [-1, 16, 28, 28]               0
        Conv_Mish-39           [-1, 16, 28, 28]               0
           Conv2d-40           [-1, 16, 28, 28]             144
      BatchNorm2d-41           [-1, 16, 28, 28]              32
             Mish-42           [-1, 16, 28, 28]               0
        Conv_Mish-43           [-1, 16, 28, 28]               0
           GSConv-44           [-1, 32, 28, 28]               0
           Conv2d-45           [-1, 16, 28, 28]           4,608
      BatchNorm2d-46           [-1, 16, 28, 28]              32
             ReLU-47           [-1, 16, 28, 28]               0
        Conv_Mish-48           [-1, 16, 28, 28]               0
           Conv2d-49           [-1, 16, 28, 28]             144
      BatchNorm2d-50           [-1, 16, 28, 28]              32
             ReLU-51           [-1, 16, 28, 28]               0
        Conv_Mish-52           [-1, 16, 28, 28]               0
           GSConv-53           [-1, 32, 28, 28]               0
     GSBottleneck-54           [-1, 32, 28, 28]               0
           Conv2d-55           [-1, 16, 28, 28]             512
      BatchNorm2d-56           [-1, 16, 28, 28]              32
             Mish-57           [-1, 16, 28, 28]               0
        Conv_Mish-58           [-1, 16, 28, 28]               0
           Conv2d-59           [-1, 16, 28, 28]             144
      BatchNorm2d-60           [-1, 16, 28, 28]              32
             Mish-61           [-1, 16, 28, 28]               0
        Conv_Mish-62           [-1, 16, 28, 28]               0
           GSConv-63           [-1, 32, 28, 28]               0
           Conv2d-64           [-1, 16, 28, 28]           4,608
      BatchNorm2d-65           [-1, 16, 28, 28]              32
             ReLU-66           [-1, 16, 28, 28]               0
        Conv_Mish-67           [-1, 16, 28, 28]               0
           Conv2d-68           [-1, 16, 28, 28]             144
      BatchNorm2d-69           [-1, 16, 28, 28]              32
             ReLU-70           [-1, 16, 28, 28]               0
        Conv_Mish-71           [-1, 16, 28, 28]               0
           GSConv-72           [-1, 32, 28, 28]               0
     GSBottleneck-73           [-1, 32, 28, 28]               0
           Conv2d-74           [-1, 16, 28, 28]             512
      BatchNorm2d-75           [-1, 16, 28, 28]              32
             Mish-76           [-1, 16, 28, 28]               0
        Conv_Mish-77           [-1, 16, 28, 28]               0
           Conv2d-78           [-1, 16, 28, 28]             144
      BatchNorm2d-79           [-1, 16, 28, 28]              32
             Mish-80           [-1, 16, 28, 28]               0
        Conv_Mish-81           [-1, 16, 28, 28]               0
           GSConv-82           [-1, 32, 28, 28]               0
           Conv2d-83           [-1, 16, 28, 28]           4,608
      BatchNorm2d-84           [-1, 16, 28, 28]              32
             ReLU-85           [-1, 16, 28, 28]               0
        Conv_Mish-86           [-1, 16, 28, 28]               0
           Conv2d-87           [-1, 16, 28, 28]             144
      BatchNorm2d-88           [-1, 16, 28, 28]              32
             ReLU-89           [-1, 16, 28, 28]               0
        Conv_Mish-90           [-1, 16, 28, 28]               0
           GSConv-91           [-1, 32, 28, 28]               0
     GSBottleneck-92           [-1, 32, 28, 28]               0
           Conv2d-93           [-1, 32, 28, 28]           2,080
      BatchNorm2d-94           [-1, 32, 28, 28]              64
             ReLU-95           [-1, 32, 28, 28]               0
             Conv-96           [-1, 32, 28, 28]               0
           Conv2d-97           [-1, 64, 28, 28]           2,112
      BatchNorm2d-98           [-1, 64, 28, 28]             128
             ReLU-99           [-1, 64, 28, 28]               0
            Conv-100           [-1, 64, 28, 28]               0
    VoVGSCSP_Res-101           [-1, 64, 28, 28]               0
          Conv2d-102           [-1, 32, 28, 28]           2,080
     BatchNorm2d-103           [-1, 32, 28, 28]              64
            ReLU-104           [-1, 32, 28, 28]               0
            Conv-105           [-1, 32, 28, 28]               0
          Conv2d-106           [-1, 16, 28, 28]             512
     BatchNorm2d-107           [-1, 16, 28, 28]              32
            Mish-108           [-1, 16, 28, 28]               0
       Conv_Mish-109           [-1, 16, 28, 28]               0
          Conv2d-110           [-1, 16, 28, 28]             144
     BatchNorm2d-111           [-1, 16, 28, 28]              32
            Mish-112           [-1, 16, 28, 28]               0
       Conv_Mish-113           [-1, 16, 28, 28]               0
          GSConv-114           [-1, 32, 28, 28]               0
          Conv2d-115           [-1, 16, 28, 28]           4,608
     BatchNorm2d-116           [-1, 16, 28, 28]              32
            ReLU-117           [-1, 16, 28, 28]               0
       Conv_Mish-118           [-1, 16, 28, 28]               0
          Conv2d-119           [-1, 16, 28, 28]             144
     BatchNorm2d-120           [-1, 16, 28, 28]              32
            ReLU-121           [-1, 16, 28, 28]               0
       Conv_Mish-122           [-1, 16, 28, 28]               0
          GSConv-123           [-1, 32, 28, 28]               0
    GSBottleneck-124           [-1, 32, 28, 28]               0
          Conv2d-125           [-1, 16, 28, 28]             512
     BatchNorm2d-126           [-1, 16, 28, 28]              32
            Mish-127           [-1, 16, 28, 28]               0
       Conv_Mish-128           [-1, 16, 28, 28]               0
          Conv2d-129           [-1, 16, 28, 28]             144
     BatchNorm2d-130           [-1, 16, 28, 28]              32
            Mish-131           [-1, 16, 28, 28]               0
       Conv_Mish-132           [-1, 16, 28, 28]               0
          GSConv-133           [-1, 32, 28, 28]               0
          Conv2d-134           [-1, 16, 28, 28]           4,608
     BatchNorm2d-135           [-1, 16, 28, 28]              32
            ReLU-136           [-1, 16, 28, 28]               0
       Conv_Mish-137           [-1, 16, 28, 28]               0
          Conv2d-138           [-1, 16, 28, 28]             144
     BatchNorm2d-139           [-1, 16, 28, 28]              32
            ReLU-140           [-1, 16, 28, 28]               0
       Conv_Mish-141           [-1, 16, 28, 28]               0
          GSConv-142           [-1, 32, 28, 28]               0
    GSBottleneck-143           [-1, 32, 28, 28]               0
          Conv2d-144           [-1, 16, 28, 28]             512
     BatchNorm2d-145           [-1, 16, 28, 28]              32
            Mish-146           [-1, 16, 28, 28]               0
       Conv_Mish-147           [-1, 16, 28, 28]               0
          Conv2d-148           [-1, 16, 28, 28]             144
     BatchNorm2d-149           [-1, 16, 28, 28]              32
            Mish-150           [-1, 16, 28, 28]               0
       Conv_Mish-151           [-1, 16, 28, 28]               0
          GSConv-152           [-1, 32, 28, 28]               0
          Conv2d-153           [-1, 16, 28, 28]           4,608
     BatchNorm2d-154           [-1, 16, 28, 28]              32
            ReLU-155           [-1, 16, 28, 28]               0
       Conv_Mish-156           [-1, 16, 28, 28]               0
          Conv2d-157           [-1, 16, 28, 28]             144
     BatchNorm2d-158           [-1, 16, 28, 28]              32
            ReLU-159           [-1, 16, 28, 28]               0
       Conv_Mish-160           [-1, 16, 28, 28]               0
          GSConv-161           [-1, 32, 28, 28]               0
    GSBottleneck-162           [-1, 32, 28, 28]               0
          Conv2d-163           [-1, 32, 28, 28]           2,080
     BatchNorm2d-164           [-1, 32, 28, 28]              64
            ReLU-165           [-1, 32, 28, 28]               0
            Conv-166           [-1, 32, 28, 28]               0
          Conv2d-167           [-1, 64, 28, 28]           2,112
     BatchNorm2d-168           [-1, 64, 28, 28]             128
            ReLU-169           [-1, 64, 28, 28]               0
            Conv-170           [-1, 64, 28, 28]               0
    VoVGSCSP_Res-171           [-1, 64, 28, 28]               0
          Conv2d-172           [-1, 32, 28, 28]           2,080
     BatchNorm2d-173           [-1, 32, 28, 28]              64
            ReLU-174           [-1, 32, 28, 28]               0
            Conv-175           [-1, 32, 28, 28]               0
          Conv2d-176           [-1, 16, 28, 28]             512
     BatchNorm2d-177           [-1, 16, 28, 28]              32
            Mish-178           [-1, 16, 28, 28]               0
       Conv_Mish-179           [-1, 16, 28, 28]               0
          Conv2d-180           [-1, 16, 28, 28]             144
     BatchNorm2d-181           [-1, 16, 28, 28]              32
            Mish-182           [-1, 16, 28, 28]               0
       Conv_Mish-183           [-1, 16, 28, 28]               0
          GSConv-184           [-1, 32, 28, 28]               0
          Conv2d-185           [-1, 16, 28, 28]           4,608
     BatchNorm2d-186           [-1, 16, 28, 28]              32
            ReLU-187           [-1, 16, 28, 28]               0
       Conv_Mish-188           [-1, 16, 28, 28]               0
          Conv2d-189           [-1, 16, 28, 28]             144
     BatchNorm2d-190           [-1, 16, 28, 28]              32
            ReLU-191           [-1, 16, 28, 28]               0
       Conv_Mish-192           [-1, 16, 28, 28]               0
          GSConv-193           [-1, 32, 28, 28]               0
    GSBottleneck-194           [-1, 32, 28, 28]               0
          Conv2d-195           [-1, 16, 28, 28]             512
     BatchNorm2d-196           [-1, 16, 28, 28]              32
            Mish-197           [-1, 16, 28, 28]               0
       Conv_Mish-198           [-1, 16, 28, 28]               0
          Conv2d-199           [-1, 16, 28, 28]             144
     BatchNorm2d-200           [-1, 16, 28, 28]              32
            Mish-201           [-1, 16, 28, 28]               0
       Conv_Mish-202           [-1, 16, 28, 28]               0
          GSConv-203           [-1, 32, 28, 28]               0
          Conv2d-204           [-1, 16, 28, 28]           4,608
     BatchNorm2d-205           [-1, 16, 28, 28]              32
            ReLU-206           [-1, 16, 28, 28]               0
       Conv_Mish-207           [-1, 16, 28, 28]               0
          Conv2d-208           [-1, 16, 28, 28]             144
     BatchNorm2d-209           [-1, 16, 28, 28]              32
            ReLU-210           [-1, 16, 28, 28]               0
       Conv_Mish-211           [-1, 16, 28, 28]               0
          GSConv-212           [-1, 32, 28, 28]               0
    GSBottleneck-213           [-1, 32, 28, 28]               0
          Conv2d-214           [-1, 16, 28, 28]             512
     BatchNorm2d-215           [-1, 16, 28, 28]              32
            Mish-216           [-1, 16, 28, 28]               0
       Conv_Mish-217           [-1, 16, 28, 28]               0
          Conv2d-218           [-1, 16, 28, 28]             144
     BatchNorm2d-219           [-1, 16, 28, 28]              32
            Mish-220           [-1, 16, 28, 28]               0
       Conv_Mish-221           [-1, 16, 28, 28]               0
          GSConv-222           [-1, 32, 28, 28]               0
          Conv2d-223           [-1, 16, 28, 28]           4,608
     BatchNorm2d-224           [-1, 16, 28, 28]              32
            ReLU-225           [-1, 16, 28, 28]               0
       Conv_Mish-226           [-1, 16, 28, 28]               0
          Conv2d-227           [-1, 16, 28, 28]             144
     BatchNorm2d-228           [-1, 16, 28, 28]              32
            ReLU-229           [-1, 16, 28, 28]               0
       Conv_Mish-230           [-1, 16, 28, 28]               0
          GSConv-231           [-1, 32, 28, 28]               0
    GSBottleneck-232           [-1, 32, 28, 28]               0
          Conv2d-233           [-1, 32, 28, 28]           2,080
     BatchNorm2d-234           [-1, 32, 28, 28]              64
            ReLU-235           [-1, 32, 28, 28]               0
            Conv-236           [-1, 32, 28, 28]               0
          Conv2d-237           [-1, 64, 28, 28]           2,112
     BatchNorm2d-238           [-1, 64, 28, 28]             128
            ReLU-239           [-1, 64, 28, 28]               0
            Conv-240           [-1, 64, 28, 28]               0
    VoVGSCSP_Res-241           [-1, 64, 28, 28]               0
 ConvTranspose2d-242           [-1, 32, 56, 56]          32,800
     BatchNorm2d-243           [-1, 32, 56, 56]              64
           Trans-244           [-1, 32, 56, 56]               0
 ConvTranspose2d-245         [-1, 16, 112, 112]           8,208
     BatchNorm2d-246         [-1, 16, 112, 112]              32
           Trans-247         [-1, 16, 112, 112]               0
 ConvTranspose2d-248         [-1, 16, 225, 225]           4,112
     BatchNorm2d-249         [-1, 16, 225, 225]              32
           Trans-250         [-1, 16, 225, 225]               0
 ConvTranspose2d-251         [-1, 16, 225, 225]          20,752
           Trans-252         [-1, 16, 225, 225]               0
         Dropout-253         [-1, 16, 225, 225]               0
          Conv2d-254          [-1, 1, 224, 224]              65
         Dropout-255         [-1, 16, 225, 225]               0
          Conv2d-256          [-1, 1, 224, 224]              65
         Dropout-257         [-1, 16, 225, 225]               0
          Conv2d-258          [-1, 1, 224, 224]              65
         Dropout-259         [-1, 16, 225, 225]               0
          Conv2d-260          [-1, 1, 224, 224]              65
================================================================
Total params: 175,092
Trainable params: 80,532
Non-trainable params: 94,560
----------------------------------------------------------------
Input size (MB): 0.77
Forward/backward pass size (MB): 142.33
Params size (MB): 0.67
Estimated Total Size (MB): 143.76
----------------------------------------------------------------
