----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 16, 224, 224]           5,200
       BatchNorm2d-2         [-1, 16, 224, 224]              32
              ReLU-3         [-1, 16, 224, 224]               0
              Conv-4         [-1, 16, 224, 224]               0
            Conv2d-5         [-1, 32, 112, 112]           8,224
       BatchNorm2d-6         [-1, 32, 112, 112]              64
              ReLU-7         [-1, 32, 112, 112]               0
              Conv-8         [-1, 32, 112, 112]               0
            Conv2d-9           [-1, 64, 56, 56]          32,832
      BatchNorm2d-10           [-1, 64, 56, 56]             128
             ReLU-11           [-1, 64, 56, 56]               0
             Conv-12           [-1, 64, 56, 56]               0
           Conv2d-13           [-1, 32, 56, 56]           2,080
      BatchNorm2d-14           [-1, 32, 56, 56]              64
             ReLU-15           [-1, 32, 56, 56]               0
             Conv-16           [-1, 32, 56, 56]               0
           Conv2d-17            [-1, 8, 56, 56]             256
      BatchNorm2d-18            [-1, 8, 56, 56]              16
             Mish-19            [-1, 8, 56, 56]               0
        Conv_Mish-20            [-1, 8, 56, 56]               0
           Conv2d-21            [-1, 8, 56, 56]              72
      BatchNorm2d-22            [-1, 8, 56, 56]              16
             Mish-23            [-1, 8, 56, 56]               0
        Conv_Mish-24            [-1, 8, 56, 56]               0
           GSConv-25           [-1, 16, 56, 56]               0
           Conv2d-26           [-1, 16, 56, 56]           2,304
      BatchNorm2d-27           [-1, 16, 56, 56]              32
             Mish-28           [-1, 16, 56, 56]               0
        Conv_Mish-29           [-1, 16, 56, 56]               0
           Conv2d-30           [-1, 16, 56, 56]             144
      BatchNorm2d-31           [-1, 16, 56, 56]              32
             Mish-32           [-1, 16, 56, 56]               0
        Conv_Mish-33           [-1, 16, 56, 56]               0
           GSConv-34           [-1, 32, 56, 56]               0
     GSBottleneck-35           [-1, 32, 56, 56]               0
           Conv2d-36            [-1, 8, 56, 56]             256
      BatchNorm2d-37            [-1, 8, 56, 56]              16
             Mish-38            [-1, 8, 56, 56]               0
        Conv_Mish-39            [-1, 8, 56, 56]               0
           Conv2d-40            [-1, 8, 56, 56]              72
      BatchNorm2d-41            [-1, 8, 56, 56]              16
             Mish-42            [-1, 8, 56, 56]               0
        Conv_Mish-43            [-1, 8, 56, 56]               0
           GSConv-44           [-1, 16, 56, 56]               0
           Conv2d-45           [-1, 16, 56, 56]           2,304
      BatchNorm2d-46           [-1, 16, 56, 56]              32
             Mish-47           [-1, 16, 56, 56]               0
        Conv_Mish-48           [-1, 16, 56, 56]               0
           Conv2d-49           [-1, 16, 56, 56]             144
      BatchNorm2d-50           [-1, 16, 56, 56]              32
             Mish-51           [-1, 16, 56, 56]               0
        Conv_Mish-52           [-1, 16, 56, 56]               0
           GSConv-53           [-1, 32, 56, 56]               0
     GSBottleneck-54           [-1, 32, 56, 56]               0
           Conv2d-55           [-1, 32, 56, 56]           2,080
      BatchNorm2d-56           [-1, 32, 56, 56]              64
             ReLU-57           [-1, 32, 56, 56]               0
             Conv-58           [-1, 32, 56, 56]               0
           Conv2d-59           [-1, 32, 56, 56]           9,248
      BatchNorm2d-60           [-1, 32, 56, 56]              64
             ReLU-61           [-1, 32, 56, 56]               0
             Conv-62           [-1, 32, 56, 56]               0
           Conv2d-63           [-1, 32, 56, 56]           9,248
      BatchNorm2d-64           [-1, 32, 56, 56]              64
             ReLU-65           [-1, 32, 56, 56]               0
             Conv-66           [-1, 32, 56, 56]               0
           Conv2d-67           [-1, 32, 56, 56]           2,080
      BatchNorm2d-68           [-1, 32, 56, 56]              64
             ReLU-69           [-1, 32, 56, 56]               0
             Conv-70           [-1, 32, 56, 56]               0
           Conv2d-71           [-1, 64, 56, 56]           6,208
      BatchNorm2d-72           [-1, 64, 56, 56]             128
             ReLU-73           [-1, 64, 56, 56]               0
             Conv-74           [-1, 64, 56, 56]               0
          GS_IRes-75           [-1, 64, 56, 56]               0
           Conv2d-76           [-1, 32, 56, 56]           2,080
      BatchNorm2d-77           [-1, 32, 56, 56]              64
             ReLU-78           [-1, 32, 56, 56]               0
             Conv-79           [-1, 32, 56, 56]               0
           Conv2d-80            [-1, 8, 56, 56]             256
      BatchNorm2d-81            [-1, 8, 56, 56]              16
             Mish-82            [-1, 8, 56, 56]               0
        Conv_Mish-83            [-1, 8, 56, 56]               0
           Conv2d-84            [-1, 8, 56, 56]              72
      BatchNorm2d-85            [-1, 8, 56, 56]              16
             Mish-86            [-1, 8, 56, 56]               0
        Conv_Mish-87            [-1, 8, 56, 56]               0
           GSConv-88           [-1, 16, 56, 56]               0
           Conv2d-89           [-1, 16, 56, 56]           2,304
      BatchNorm2d-90           [-1, 16, 56, 56]              32
             Mish-91           [-1, 16, 56, 56]               0
        Conv_Mish-92           [-1, 16, 56, 56]               0
           Conv2d-93           [-1, 16, 56, 56]             144
      BatchNorm2d-94           [-1, 16, 56, 56]              32
             Mish-95           [-1, 16, 56, 56]               0
        Conv_Mish-96           [-1, 16, 56, 56]               0
           GSConv-97           [-1, 32, 56, 56]               0
     GSBottleneck-98           [-1, 32, 56, 56]               0
           Conv2d-99            [-1, 8, 56, 56]             256
     BatchNorm2d-100            [-1, 8, 56, 56]              16
            Mish-101            [-1, 8, 56, 56]               0
       Conv_Mish-102            [-1, 8, 56, 56]               0
          Conv2d-103            [-1, 8, 56, 56]              72
     BatchNorm2d-104            [-1, 8, 56, 56]              16
            Mish-105            [-1, 8, 56, 56]               0
       Conv_Mish-106            [-1, 8, 56, 56]               0
          GSConv-107           [-1, 16, 56, 56]               0
          Conv2d-108           [-1, 16, 56, 56]           2,304
     BatchNorm2d-109           [-1, 16, 56, 56]              32
            Mish-110           [-1, 16, 56, 56]               0
       Conv_Mish-111           [-1, 16, 56, 56]               0
          Conv2d-112           [-1, 16, 56, 56]             144
     BatchNorm2d-113           [-1, 16, 56, 56]              32
            Mish-114           [-1, 16, 56, 56]               0
       Conv_Mish-115           [-1, 16, 56, 56]               0
          GSConv-116           [-1, 32, 56, 56]               0
    GSBottleneck-117           [-1, 32, 56, 56]               0
          Conv2d-118           [-1, 32, 56, 56]           2,080
     BatchNorm2d-119           [-1, 32, 56, 56]              64
            ReLU-120           [-1, 32, 56, 56]               0
            Conv-121           [-1, 32, 56, 56]               0
          Conv2d-122           [-1, 32, 56, 56]           9,248
     BatchNorm2d-123           [-1, 32, 56, 56]              64
            ReLU-124           [-1, 32, 56, 56]               0
            Conv-125           [-1, 32, 56, 56]               0
          Conv2d-126           [-1, 32, 56, 56]           9,248
     BatchNorm2d-127           [-1, 32, 56, 56]              64
            ReLU-128           [-1, 32, 56, 56]               0
            Conv-129           [-1, 32, 56, 56]               0
          Conv2d-130           [-1, 32, 56, 56]           2,080
     BatchNorm2d-131           [-1, 32, 56, 56]              64
            ReLU-132           [-1, 32, 56, 56]               0
            Conv-133           [-1, 32, 56, 56]               0
          Conv2d-134           [-1, 64, 56, 56]           6,208
     BatchNorm2d-135           [-1, 64, 56, 56]             128
            ReLU-136           [-1, 64, 56, 56]               0
            Conv-137           [-1, 64, 56, 56]               0
         GS_IRes-138           [-1, 64, 56, 56]               0
          Conv2d-139           [-1, 32, 56, 56]           2,080
     BatchNorm2d-140           [-1, 32, 56, 56]              64
            ReLU-141           [-1, 32, 56, 56]               0
            Conv-142           [-1, 32, 56, 56]               0
          Conv2d-143            [-1, 8, 56, 56]             256
     BatchNorm2d-144            [-1, 8, 56, 56]              16
            Mish-145            [-1, 8, 56, 56]               0
       Conv_Mish-146            [-1, 8, 56, 56]               0
          Conv2d-147            [-1, 8, 56, 56]              72
     BatchNorm2d-148            [-1, 8, 56, 56]              16
            Mish-149            [-1, 8, 56, 56]               0
       Conv_Mish-150            [-1, 8, 56, 56]               0
          GSConv-151           [-1, 16, 56, 56]               0
          Conv2d-152           [-1, 16, 56, 56]           2,304
     BatchNorm2d-153           [-1, 16, 56, 56]              32
            Mish-154           [-1, 16, 56, 56]               0
       Conv_Mish-155           [-1, 16, 56, 56]               0
          Conv2d-156           [-1, 16, 56, 56]             144
     BatchNorm2d-157           [-1, 16, 56, 56]              32
            Mish-158           [-1, 16, 56, 56]               0
       Conv_Mish-159           [-1, 16, 56, 56]               0
          GSConv-160           [-1, 32, 56, 56]               0
    GSBottleneck-161           [-1, 32, 56, 56]               0
          Conv2d-162            [-1, 8, 56, 56]             256
     BatchNorm2d-163            [-1, 8, 56, 56]              16
            Mish-164            [-1, 8, 56, 56]               0
       Conv_Mish-165            [-1, 8, 56, 56]               0
          Conv2d-166            [-1, 8, 56, 56]              72
     BatchNorm2d-167            [-1, 8, 56, 56]              16
            Mish-168            [-1, 8, 56, 56]               0
       Conv_Mish-169            [-1, 8, 56, 56]               0
          GSConv-170           [-1, 16, 56, 56]               0
          Conv2d-171           [-1, 16, 56, 56]           2,304
     BatchNorm2d-172           [-1, 16, 56, 56]              32
            Mish-173           [-1, 16, 56, 56]               0
       Conv_Mish-174           [-1, 16, 56, 56]               0
          Conv2d-175           [-1, 16, 56, 56]             144
     BatchNorm2d-176           [-1, 16, 56, 56]              32
            Mish-177           [-1, 16, 56, 56]               0
       Conv_Mish-178           [-1, 16, 56, 56]               0
          GSConv-179           [-1, 32, 56, 56]               0
    GSBottleneck-180           [-1, 32, 56, 56]               0
          Conv2d-181           [-1, 32, 56, 56]           2,080
     BatchNorm2d-182           [-1, 32, 56, 56]              64
            ReLU-183           [-1, 32, 56, 56]               0
            Conv-184           [-1, 32, 56, 56]               0
          Conv2d-185           [-1, 32, 56, 56]           9,248
     BatchNorm2d-186           [-1, 32, 56, 56]              64
            ReLU-187           [-1, 32, 56, 56]               0
            Conv-188           [-1, 32, 56, 56]               0
          Conv2d-189           [-1, 32, 56, 56]           9,248
     BatchNorm2d-190           [-1, 32, 56, 56]              64
            ReLU-191           [-1, 32, 56, 56]               0
            Conv-192           [-1, 32, 56, 56]               0
          Conv2d-193           [-1, 32, 56, 56]           2,080
     BatchNorm2d-194           [-1, 32, 56, 56]              64
            ReLU-195           [-1, 32, 56, 56]               0
            Conv-196           [-1, 32, 56, 56]               0
          Conv2d-197           [-1, 64, 56, 56]           6,208
     BatchNorm2d-198           [-1, 64, 56, 56]             128
            ReLU-199           [-1, 64, 56, 56]               0
            Conv-200           [-1, 64, 56, 56]               0
         GS_IRes-201           [-1, 64, 56, 56]               0
 ConvTranspose2d-202         [-1, 32, 113, 113]          32,800
     BatchNorm2d-203         [-1, 32, 113, 113]              64
           Trans-204         [-1, 32, 113, 113]               0
 ConvTranspose2d-205         [-1, 16, 225, 225]           8,208
     BatchNorm2d-206         [-1, 16, 225, 225]              32
           Trans-207         [-1, 16, 225, 225]               0
 ConvTranspose2d-208         [-1, 16, 225, 225]          20,752
           Trans-209         [-1, 16, 225, 225]               0
         Dropout-210         [-1, 16, 225, 225]               0
          Conv2d-211          [-1, 1, 224, 224]              65
         Dropout-212         [-1, 16, 225, 225]               0
          Conv2d-213          [-1, 1, 224, 224]              65
         Dropout-214         [-1, 16, 225, 225]               0
          Conv2d-215          [-1, 1, 224, 224]              65
         Dropout-216         [-1, 16, 225, 225]               0
          Conv2d-217          [-1, 1, 224, 224]              65
================================================================
Total params: 220,004
Trainable params: 111,668
Non-trainable params: 108,336
----------------------------------------------------------------
Input size (MB): 0.77
Forward/backward pass size (MB): 217.33
Params size (MB): 0.84
Estimated Total Size (MB): 218.93
----------------------------------------------------------------
