----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 16, 224, 224]             592
       BatchNorm2d-2         [-1, 16, 224, 224]              32
            Conv2d-3         [-1, 32, 112, 112]           8,224
       BatchNorm2d-4         [-1, 32, 112, 112]              64
            Conv2d-5           [-1, 64, 56, 56]          32,832
       BatchNorm2d-6           [-1, 64, 56, 56]             128
            Conv2d-7           [-1, 32, 56, 56]           2,080
       BatchNorm2d-8           [-1, 32, 56, 56]              64
              SiLU-9           [-1, 32, 56, 56]               0
             Conv-10           [-1, 32, 56, 56]               0
           Conv2d-11           [-1, 32, 56, 56]           1,056
      BatchNorm2d-12           [-1, 32, 56, 56]              64
             SiLU-13           [-1, 32, 56, 56]               0
             Conv-14           [-1, 32, 56, 56]               0
           Conv2d-15           [-1, 32, 56, 56]           9,248
      BatchNorm2d-16           [-1, 32, 56, 56]              64
             SiLU-17           [-1, 32, 56, 56]               0
             Conv-18           [-1, 32, 56, 56]               0
       Bottleneck-19           [-1, 32, 56, 56]               0
           Conv2d-20           [-1, 32, 56, 56]          18,464
      BatchNorm2d-21           [-1, 32, 56, 56]              64
             SiLU-22           [-1, 32, 56, 56]               0
             Conv-23           [-1, 32, 56, 56]               0
           Conv2d-24           [-1, 64, 56, 56]           4,160
      BatchNorm2d-25           [-1, 64, 56, 56]             128
             SiLU-26           [-1, 64, 56, 56]               0
             Conv-27           [-1, 64, 56, 56]               0
AdaptiveAvgPool2d-28            [-1, 64, 56, 1]               0
AdaptiveAvgPool2d-29            [-1, 64, 1, 56]               0
           Conv2d-30            [-1, 8, 112, 1]             520
      BatchNorm2d-31            [-1, 8, 112, 1]              16
            ReLU6-32            [-1, 8, 112, 1]               0
        h_sigmoid-33            [-1, 8, 112, 1]               0
          h_swish-34            [-1, 8, 112, 1]               0
           Conv2d-35            [-1, 64, 56, 1]             576
           Conv2d-36            [-1, 64, 1, 56]             576
         CoordAtt-37           [-1, 64, 56, 56]               0
            C3_CA-38           [-1, 64, 56, 56]               0
           Conv2d-39           [-1, 64, 56, 56]          36,928
      BatchNorm2d-40           [-1, 64, 56, 56]             128
             ReLU-41           [-1, 64, 56, 56]               0
           Conv2d-42           [-1, 64, 56, 56]          36,928
      BatchNorm2d-43           [-1, 64, 56, 56]             128
AdaptiveAvgPool2d-44            [-1, 64, 56, 1]               0
AdaptiveAvgPool2d-45            [-1, 64, 1, 56]               0
           Conv2d-46            [-1, 8, 112, 1]             520
      BatchNorm2d-47            [-1, 8, 112, 1]              16
            ReLU6-48            [-1, 8, 112, 1]               0
        h_sigmoid-49            [-1, 8, 112, 1]               0
          h_swish-50            [-1, 8, 112, 1]               0
           Conv2d-51            [-1, 64, 56, 1]             576
           Conv2d-52            [-1, 64, 1, 56]             576
         CoordAtt-53           [-1, 64, 56, 56]               0
             ReLU-54           [-1, 64, 56, 56]               0
            CARes-55           [-1, 64, 56, 56]               0
           Conv2d-56           [-1, 32, 56, 56]           2,080
      BatchNorm2d-57           [-1, 32, 56, 56]              64
             SiLU-58           [-1, 32, 56, 56]               0
             Conv-59           [-1, 32, 56, 56]               0
           Conv2d-60           [-1, 32, 56, 56]           1,056
      BatchNorm2d-61           [-1, 32, 56, 56]              64
             SiLU-62           [-1, 32, 56, 56]               0
             Conv-63           [-1, 32, 56, 56]               0
           Conv2d-64           [-1, 32, 56, 56]           9,248
      BatchNorm2d-65           [-1, 32, 56, 56]              64
             SiLU-66           [-1, 32, 56, 56]               0
             Conv-67           [-1, 32, 56, 56]               0
       Bottleneck-68           [-1, 32, 56, 56]               0
           Conv2d-69           [-1, 32, 56, 56]          18,464
      BatchNorm2d-70           [-1, 32, 56, 56]              64
             SiLU-71           [-1, 32, 56, 56]               0
             Conv-72           [-1, 32, 56, 56]               0
           Conv2d-73           [-1, 64, 56, 56]           4,160
      BatchNorm2d-74           [-1, 64, 56, 56]             128
             SiLU-75           [-1, 64, 56, 56]               0
             Conv-76           [-1, 64, 56, 56]               0
AdaptiveAvgPool2d-77            [-1, 64, 56, 1]               0
AdaptiveAvgPool2d-78            [-1, 64, 1, 56]               0
           Conv2d-79            [-1, 8, 112, 1]             520
      BatchNorm2d-80            [-1, 8, 112, 1]              16
            ReLU6-81            [-1, 8, 112, 1]               0
        h_sigmoid-82            [-1, 8, 112, 1]               0
          h_swish-83            [-1, 8, 112, 1]               0
           Conv2d-84            [-1, 64, 56, 1]             576
           Conv2d-85            [-1, 64, 1, 56]             576
         CoordAtt-86           [-1, 64, 56, 56]               0
            C3_CA-87           [-1, 64, 56, 56]               0
           Conv2d-88           [-1, 64, 56, 56]          36,928
      BatchNorm2d-89           [-1, 64, 56, 56]             128
             ReLU-90           [-1, 64, 56, 56]               0
           Conv2d-91           [-1, 64, 56, 56]          36,928
      BatchNorm2d-92           [-1, 64, 56, 56]             128
AdaptiveAvgPool2d-93            [-1, 64, 56, 1]               0
AdaptiveAvgPool2d-94            [-1, 64, 1, 56]               0
           Conv2d-95            [-1, 8, 112, 1]             520
      BatchNorm2d-96            [-1, 8, 112, 1]              16
            ReLU6-97            [-1, 8, 112, 1]               0
        h_sigmoid-98            [-1, 8, 112, 1]               0
          h_swish-99            [-1, 8, 112, 1]               0
          Conv2d-100            [-1, 64, 56, 1]             576
          Conv2d-101            [-1, 64, 1, 56]             576
        CoordAtt-102           [-1, 64, 56, 56]               0
            ReLU-103           [-1, 64, 56, 56]               0
           CARes-104           [-1, 64, 56, 56]               0
 ConvTranspose2d-105         [-1, 32, 113, 113]          32,800
     BatchNorm2d-106         [-1, 32, 113, 113]              64
 ConvTranspose2d-107         [-1, 16, 225, 225]           8,208
     BatchNorm2d-108         [-1, 16, 225, 225]              32
 ConvTranspose2d-109         [-1, 16, 225, 225]          20,752
         Dropout-110         [-1, 16, 225, 225]               0
          Conv2d-111          [-1, 1, 224, 224]              65
         Dropout-112         [-1, 16, 225, 225]               0
          Conv2d-113          [-1, 1, 224, 224]              65
         Dropout-114         [-1, 16, 225, 225]               0
          Conv2d-115          [-1, 1, 224, 224]              65
         Dropout-116         [-1, 16, 225, 225]               0
          Conv2d-117          [-1, 1, 224, 224]              65
================================================================
Total params: 329,748
Trainable params: 329,748
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.77
Forward/backward pass size (MB): 141.94
Params size (MB): 1.26
Estimated Total Size (MB): 143.97
----------------------------------------------------------------
