----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 16, 224, 224]             592
       BatchNorm2d-2         [-1, 16, 224, 224]              32
            Conv2d-3         [-1, 32, 112, 112]           8,224
       BatchNorm2d-4         [-1, 32, 112, 112]              64
            Conv2d-5           [-1, 64, 56, 56]          32,832
       BatchNorm2d-6           [-1, 64, 56, 56]             128
            Conv2d-7           [-1, 32, 56, 56]           2,080
       BatchNorm2d-8           [-1, 32, 56, 56]              64
              SiLU-9           [-1, 32, 56, 56]               0
             Conv-10           [-1, 32, 56, 56]               0
           Conv2d-11           [-1, 32, 56, 56]           1,056
      BatchNorm2d-12           [-1, 32, 56, 56]              64
             SiLU-13           [-1, 32, 56, 56]               0
             Conv-14           [-1, 32, 56, 56]               0
           Conv2d-15           [-1, 32, 56, 56]           9,248
      BatchNorm2d-16           [-1, 32, 56, 56]              64
             SiLU-17           [-1, 32, 56, 56]               0
             Conv-18           [-1, 32, 56, 56]               0
       Bottleneck-19           [-1, 32, 56, 56]               0
           Conv2d-20           [-1, 32, 56, 56]           1,056
      BatchNorm2d-21           [-1, 32, 56, 56]              64
             SiLU-22           [-1, 32, 56, 56]               0
             Conv-23           [-1, 32, 56, 56]               0
           Conv2d-24           [-1, 32, 56, 56]           9,248
      BatchNorm2d-25           [-1, 32, 56, 56]              64
             SiLU-26           [-1, 32, 56, 56]               0
             Conv-27           [-1, 32, 56, 56]               0
       Bottleneck-28           [-1, 32, 56, 56]               0
           Conv2d-29           [-1, 32, 56, 56]           1,056
      BatchNorm2d-30           [-1, 32, 56, 56]              64
             SiLU-31           [-1, 32, 56, 56]               0
             Conv-32           [-1, 32, 56, 56]               0
           Conv2d-33           [-1, 32, 56, 56]           9,248
      BatchNorm2d-34           [-1, 32, 56, 56]              64
             SiLU-35           [-1, 32, 56, 56]               0
             Conv-36           [-1, 32, 56, 56]               0
       Bottleneck-37           [-1, 32, 56, 56]               0
           Conv2d-38           [-1, 32, 56, 56]          18,464
      BatchNorm2d-39           [-1, 32, 56, 56]              64
             SiLU-40           [-1, 32, 56, 56]               0
             Conv-41           [-1, 32, 56, 56]               0
           Conv2d-42           [-1, 64, 56, 56]           4,160
      BatchNorm2d-43           [-1, 64, 56, 56]             128
             SiLU-44           [-1, 64, 56, 56]               0
             Conv-45           [-1, 64, 56, 56]               0
               C3-46           [-1, 64, 56, 56]               0
           Conv2d-47           [-1, 32, 56, 56]           2,080
      BatchNorm2d-48           [-1, 32, 56, 56]              64
             SiLU-49           [-1, 32, 56, 56]               0
             Conv-50           [-1, 32, 56, 56]               0
           Conv2d-51           [-1, 32, 56, 56]           1,056
      BatchNorm2d-52           [-1, 32, 56, 56]              64
             SiLU-53           [-1, 32, 56, 56]               0
             Conv-54           [-1, 32, 56, 56]               0
           Conv2d-55           [-1, 32, 56, 56]           9,248
      BatchNorm2d-56           [-1, 32, 56, 56]              64
             SiLU-57           [-1, 32, 56, 56]               0
             Conv-58           [-1, 32, 56, 56]               0
       Bottleneck-59           [-1, 32, 56, 56]               0
           Conv2d-60           [-1, 32, 56, 56]           1,056
      BatchNorm2d-61           [-1, 32, 56, 56]              64
             SiLU-62           [-1, 32, 56, 56]               0
             Conv-63           [-1, 32, 56, 56]               0
           Conv2d-64           [-1, 32, 56, 56]           9,248
      BatchNorm2d-65           [-1, 32, 56, 56]              64
             SiLU-66           [-1, 32, 56, 56]               0
             Conv-67           [-1, 32, 56, 56]               0
       Bottleneck-68           [-1, 32, 56, 56]               0
           Conv2d-69           [-1, 32, 56, 56]           1,056
      BatchNorm2d-70           [-1, 32, 56, 56]              64
             SiLU-71           [-1, 32, 56, 56]               0
             Conv-72           [-1, 32, 56, 56]               0
           Conv2d-73           [-1, 32, 56, 56]           9,248
      BatchNorm2d-74           [-1, 32, 56, 56]              64
             SiLU-75           [-1, 32, 56, 56]               0
             Conv-76           [-1, 32, 56, 56]               0
       Bottleneck-77           [-1, 32, 56, 56]               0
           Conv2d-78           [-1, 32, 56, 56]          18,464
      BatchNorm2d-79           [-1, 32, 56, 56]              64
             SiLU-80           [-1, 32, 56, 56]               0
             Conv-81           [-1, 32, 56, 56]               0
           Conv2d-82           [-1, 64, 56, 56]           4,160
      BatchNorm2d-83           [-1, 64, 56, 56]             128
             SiLU-84           [-1, 64, 56, 56]               0
             Conv-85           [-1, 64, 56, 56]               0
               C3-86           [-1, 64, 56, 56]               0
           Conv2d-87           [-1, 32, 56, 56]           2,080
      BatchNorm2d-88           [-1, 32, 56, 56]              64
             SiLU-89           [-1, 32, 56, 56]               0
             Conv-90           [-1, 32, 56, 56]               0
           Conv2d-91           [-1, 32, 56, 56]           1,056
      BatchNorm2d-92           [-1, 32, 56, 56]              64
             SiLU-93           [-1, 32, 56, 56]               0
             Conv-94           [-1, 32, 56, 56]               0
           Conv2d-95           [-1, 32, 56, 56]           9,248
      BatchNorm2d-96           [-1, 32, 56, 56]              64
             SiLU-97           [-1, 32, 56, 56]               0
             Conv-98           [-1, 32, 56, 56]               0
       Bottleneck-99           [-1, 32, 56, 56]               0
          Conv2d-100           [-1, 32, 56, 56]           1,056
     BatchNorm2d-101           [-1, 32, 56, 56]              64
            SiLU-102           [-1, 32, 56, 56]               0
            Conv-103           [-1, 32, 56, 56]               0
          Conv2d-104           [-1, 32, 56, 56]           9,248
     BatchNorm2d-105           [-1, 32, 56, 56]              64
            SiLU-106           [-1, 32, 56, 56]               0
            Conv-107           [-1, 32, 56, 56]               0
      Bottleneck-108           [-1, 32, 56, 56]               0
          Conv2d-109           [-1, 32, 56, 56]           1,056
     BatchNorm2d-110           [-1, 32, 56, 56]              64
            SiLU-111           [-1, 32, 56, 56]               0
            Conv-112           [-1, 32, 56, 56]               0
          Conv2d-113           [-1, 32, 56, 56]           9,248
     BatchNorm2d-114           [-1, 32, 56, 56]              64
            SiLU-115           [-1, 32, 56, 56]               0
            Conv-116           [-1, 32, 56, 56]               0
      Bottleneck-117           [-1, 32, 56, 56]               0
          Conv2d-118           [-1, 32, 56, 56]          18,464
     BatchNorm2d-119           [-1, 32, 56, 56]              64
            SiLU-120           [-1, 32, 56, 56]               0
            Conv-121           [-1, 32, 56, 56]               0
          Conv2d-122           [-1, 64, 56, 56]           4,160
     BatchNorm2d-123           [-1, 64, 56, 56]             128
            SiLU-124           [-1, 64, 56, 56]               0
            Conv-125           [-1, 64, 56, 56]               0
              C3-126           [-1, 64, 56, 56]               0
 ConvTranspose2d-127         [-1, 32, 113, 113]          32,800
     BatchNorm2d-128         [-1, 32, 113, 113]              64
 ConvTranspose2d-129         [-1, 16, 225, 225]           8,208
     BatchNorm2d-130         [-1, 16, 225, 225]              32
 ConvTranspose2d-131         [-1, 16, 225, 225]          20,752
         Dropout-132         [-1, 16, 225, 225]               0
          Conv2d-133          [-1, 1, 224, 224]              65
         Dropout-134         [-1, 16, 225, 225]               0
          Conv2d-135          [-1, 1, 224, 224]              65
         Dropout-136         [-1, 16, 225, 225]               0
          Conv2d-137          [-1, 1, 224, 224]              65
         Dropout-138         [-1, 16, 225, 225]               0
          Conv2d-139          [-1, 1, 224, 224]              65
================================================================
Total params: 272,756
Trainable params: 272,756
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.77
Forward/backward pass size (MB): 175.82
Params size (MB): 1.04
Estimated Total Size (MB): 177.63
----------------------------------------------------------------
